[Killed] MethodExpression
src/redaction.ts:36:23
 export const PublicDossier = z.object({
   id: SuspectId,
   publicPersona: z.string().min(1),
-  knownFacts: z.array(z.string().min(1)),
+  knownFacts: z.array(z.string().max(1)),
   relationships: z.array(
     z.object({
killedBy: public projection schemas PublicDossier accepts a redacted dossier and rejects malformed/empty input
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/redaction.ts:70:7
  * Exactly: { id, victim, weapons, locations, timeline, suspects, clues }
  */
 export const PublicCaseFile = z.object({
-  id: z.string().min(1),
+  id: z.string().max(1),
   victim: Victim,
   weapons: z.array(Weapon),
killedBy: public projection schemas PublicCaseFile accepts a redacted case file and rejects malformed/empty input
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/redaction.ts:89:58
  * Explicitly picks: id, publicPersona, knownFacts, relationships.
  * OMITS: secrets, alibi (incl. claim), knowledge, isGuilty, role.
  */
-export function redactDossier(d: Dossier): PublicDossier {
-  return {
-    id: d.id,
-    publicPersona: d.publicPersona,
-    knownFacts: d.knownFacts,
-    relationships: d.relationships,
-  };
-}
+export function redactDossier(d: Dossier): PublicDossier {}
 
 /**
killedBy: redactDossier preserves exactly id, publicPersona, knownFacts, relationships
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/redaction.ts:106:49
  * Uses conditional spread under exactOptionalPropertyTypes:
  * never emits { refersTo: undefined }.
  */
-export function redactClue(c: Clue): PublicClue {
-  return {
-    id: c.id,
-    statement: c.statement,
-    ...(c.refersTo !== undefined ? { refersTo: c.refersTo } : {}),
-  };
-}
+export function redactClue(c: Clue): PublicClue {}
 
 /**
killedBy: redactClue omits reliability and preserves id + statement
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/redaction.ts:110:9
   return {
     id: c.id,
     statement: c.statement,
-    ...(c.refersTo !== undefined ? { refersTo: c.refersTo } : {}),
+    ...(c.refersTo === undefined ? { refersTo: c.refersTo } : {}),
   };
 }
killedBy: redactClue preserves refersTo when present
statusReason: expected undefined to deeply equal { suspectId: 'suspect-rourke', …(3) }

[Killed] ConditionalExpression
src/redaction.ts:110:9
   return {
     id: c.id,
     statement: c.statement,
-    ...(c.refersTo !== undefined ? { refersTo: c.refersTo } : {}),
+    ...(false ? { refersTo: c.refersTo } : {}),
   };
 }
killedBy: redactClue preserves refersTo when present
statusReason: expected undefined to deeply equal { suspectId: 'suspect-rourke', …(3) }

[Killed] BlockStatement
src/redaction.ts:119:64
  * Explicitly picks: id, victim, weapons, locations, timeline, suspects, clues.
  * OMITS: solution (and all its subfields: killerId, victimId, weaponId, locationId, timeSlotId).
  */
-export function toPublicCaseFile(cf: CaseFile): PublicCaseFile {
-  return {
-    id: cf.id,
-    victim: cf.victim,
-    weapons: cf.weapons,
-    locations: cf.locations,
-    timeline: cf.timeline,
-    suspects: cf.suspects.map(redactDossier),
-    clues: cf.clues.map(redactClue),
-  };
-}
+export function toPublicCaseFile(cf: CaseFile): PublicCaseFile {}
 
killedBy: toPublicCaseFile drops solution and keeps exactly the public top-level keys
statusReason: Cannot convert undefined or null to object
