[Killed] MethodExpression
src/accusation.ts:15:11
  * accusedSuspectId: SuspectId brand means the victim (VictimId) cannot be accused at compile time.
  */
 export const Accusation = z.object({
-  caseId: z.string().min(1),
+  caseId: z.string().max(1),
   accusedSuspectId: SuspectId,
   weaponId: WeaponId.optional(),
killedBy: validateAccusation — A1a–A1e ok:true with no optional fields (all optional branches skipped)
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] ConditionalExpression
src/accusation.ts:39:7
   const issues: CaseIssueCode[] = [];
 
   // A1a: accusation must target the correct case
-  if (acc.caseId !== cf.id) {
+  if (true) {
     issues.push(CaseIssueCode.ACCUSATION_CASE_MISMATCH);
   }
killedBy: validateAccusation — A1a–A1e ok:true with no optional fields (all optional branches skipped)
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] EqualityOperator
src/accusation.ts:39:7
   const issues: CaseIssueCode[] = [];
 
   // A1a: accusation must target the correct case
-  if (acc.caseId !== cf.id) {
+  if (acc.caseId === cf.id) {
     issues.push(CaseIssueCode.ACCUSATION_CASE_MISMATCH);
   }
killedBy: validateAccusation — A1a–A1e ok:true with no optional fields (all optional branches skipped)
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] ArrowFunction
src/accusation.ts:44:46
   }
 
   // A1b: accusedSuspectId must be a known suspect
-  const suspectIds = new Set(cf.suspects.map((s) => s.id as string));
+  const suspectIds = new Set(cf.suspects.map(() => undefined));
   if (!suspectIds.has(acc.accusedSuspectId)) {
     issues.push(CaseIssueCode.ACCUSED_NOT_SUSPECT);
killedBy: validateAccusation — A1a–A1e ok:true with no optional fields (all optional branches skipped)
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] ConditionalExpression
src/accusation.ts:45:7
 
   // A1b: accusedSuspectId must be a known suspect
   const suspectIds = new Set(cf.suspects.map((s) => s.id as string));
-  if (!suspectIds.has(acc.accusedSuspectId)) {
+  if (false) {
     issues.push(CaseIssueCode.ACCUSED_NOT_SUSPECT);
   }
killedBy: validateAccusation — A1a–A1e A1b: ACCUSED_NOT_SUSPECT on unknown accused id
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/accusation.ts:45:46
 
   // A1b: accusedSuspectId must be a known suspect
   const suspectIds = new Set(cf.suspects.map((s) => s.id as string));
-  if (!suspectIds.has(acc.accusedSuspectId)) {
-    issues.push(CaseIssueCode.ACCUSED_NOT_SUSPECT);
-  }
+  if (!suspectIds.has(acc.accusedSuspectId)) {}
 
   // A1c: optional weaponId must resolve
killedBy: validateAccusation — A1a–A1e A1b: ACCUSED_NOT_SUSPECT on unknown accused id
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/accusation.ts:50:7
   }
 
   // A1c: optional weaponId must resolve
-  if (acc.weaponId !== undefined) {
+  if (false) {
     const weaponIds = new Set(cf.weapons.map((w) => w.id as string));
     if (!weaponIds.has(acc.weaponId)) {
killedBy: validateAccusation — A1a–A1e A1c: ACCUSED_WEAPON_RESOLVES on unknown weaponId
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/accusation.ts:50:7
   }
 
   // A1c: optional weaponId must resolve
-  if (acc.weaponId !== undefined) {
+  if (true) {
     const weaponIds = new Set(cf.weapons.map((w) => w.id as string));
     if (!weaponIds.has(acc.weaponId)) {
killedBy: validateAccusation — A1a–A1e ok:true with no optional fields (all optional branches skipped)
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] ArrowFunction
src/accusation.ts:51:46
 
   // A1c: optional weaponId must resolve
   if (acc.weaponId !== undefined) {
-    const weaponIds = new Set(cf.weapons.map((w) => w.id as string));
+    const weaponIds = new Set(cf.weapons.map(() => undefined));
     if (!weaponIds.has(acc.weaponId)) {
       issues.push(CaseIssueCode.ACCUSED_WEAPON_RESOLVES);
killedBy: validateAccusation — A1a–A1e ok:true with every optional present and resolving
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] ConditionalExpression
src/accusation.ts:52:9
   // A1c: optional weaponId must resolve
   if (acc.weaponId !== undefined) {
     const weaponIds = new Set(cf.weapons.map((w) => w.id as string));
-    if (!weaponIds.has(acc.weaponId)) {
+    if (false) {
       issues.push(CaseIssueCode.ACCUSED_WEAPON_RESOLVES);
     }
killedBy: validateAccusation — A1a–A1e A1c: ACCUSED_WEAPON_RESOLVES on unknown weaponId
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/accusation.ts:52:9
   // A1c: optional weaponId must resolve
   if (acc.weaponId !== undefined) {
     const weaponIds = new Set(cf.weapons.map((w) => w.id as string));
-    if (!weaponIds.has(acc.weaponId)) {
+    if (true) {
       issues.push(CaseIssueCode.ACCUSED_WEAPON_RESOLVES);
     }
killedBy: validateAccusation — A1a–A1e ok:true with every optional present and resolving
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] ConditionalExpression
src/accusation.ts:58:7
   }
 
   // A1d: optional locationId must resolve
-  if (acc.locationId !== undefined) {
+  if (false) {
     const locationIds = new Set(cf.locations.map((l) => l.id as string));
     if (!locationIds.has(acc.locationId)) {
killedBy: validateAccusation — A1a–A1e A1d: ACCUSED_LOCATION_RESOLVES on unknown locationId
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/accusation.ts:58:37
   }
 
   // A1d: optional locationId must resolve
-  if (acc.locationId !== undefined) {
-    const locationIds = new Set(cf.locations.map((l) => l.id as string));
-    if (!locationIds.has(acc.locationId)) {
-      issues.push(CaseIssueCode.ACCUSED_LOCATION_RESOLVES);
-    }
-  }
+  if (acc.locationId !== undefined) {}
 
   // A1e: optional timeSlotId must resolve
killedBy: validateAccusation — A1a–A1e A1d: ACCUSED_LOCATION_RESOLVES on unknown locationId
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/accusation.ts:59:50
 
   // A1d: optional locationId must resolve
   if (acc.locationId !== undefined) {
-    const locationIds = new Set(cf.locations.map((l) => l.id as string));
+    const locationIds = new Set(cf.locations.map(() => undefined));
     if (!locationIds.has(acc.locationId)) {
       issues.push(CaseIssueCode.ACCUSED_LOCATION_RESOLVES);
killedBy: validateAccusation — A1a–A1e ok:true with every optional present and resolving
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] ConditionalExpression
src/accusation.ts:60:9
   // A1d: optional locationId must resolve
   if (acc.locationId !== undefined) {
     const locationIds = new Set(cf.locations.map((l) => l.id as string));
-    if (!locationIds.has(acc.locationId)) {
+    if (true) {
       issues.push(CaseIssueCode.ACCUSED_LOCATION_RESOLVES);
     }
killedBy: validateAccusation — A1a–A1e ok:true with every optional present and resolving
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] BooleanLiteral
src/accusation.ts:60:9
   // A1d: optional locationId must resolve
   if (acc.locationId !== undefined) {
     const locationIds = new Set(cf.locations.map((l) => l.id as string));
-    if (!locationIds.has(acc.locationId)) {
+    if (locationIds.has(acc.locationId)) {
       issues.push(CaseIssueCode.ACCUSED_LOCATION_RESOLVES);
     }
killedBy: validateAccusation — A1a–A1e ok:true with every optional present and resolving
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] BlockStatement
src/accusation.ts:66:37
   }
 
   // A1e: optional timeSlotId must resolve
-  if (acc.timeSlotId !== undefined) {
-    const timeSlotIds = new Set(cf.timeline.map((t) => t.id as string));
-    if (!timeSlotIds.has(acc.timeSlotId)) {
-      issues.push(CaseIssueCode.ACCUSED_TIMESLOT_RESOLVES);
-    }
-  }
+  if (acc.timeSlotId !== undefined) {}
 
   return { ok: issues.length === 0, issues };
killedBy: validateAccusation — A1a–A1e A1e: ACCUSED_TIMESLOT_RESOLVES on unknown timeSlotId
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/accusation.ts:66:7
   }
 
   // A1e: optional timeSlotId must resolve
-  if (acc.timeSlotId !== undefined) {
+  if (acc.timeSlotId === undefined) {
     const timeSlotIds = new Set(cf.timeline.map((t) => t.id as string));
     if (!timeSlotIds.has(acc.timeSlotId)) {
killedBy: validateAccusation — A1a–A1e ok:true with no optional fields (all optional branches skipped)
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] ArrowFunction
src/accusation.ts:67:49
 
   // A1e: optional timeSlotId must resolve
   if (acc.timeSlotId !== undefined) {
-    const timeSlotIds = new Set(cf.timeline.map((t) => t.id as string));
+    const timeSlotIds = new Set(cf.timeline.map(() => undefined));
     if (!timeSlotIds.has(acc.timeSlotId)) {
       issues.push(CaseIssueCode.ACCUSED_TIMESLOT_RESOLVES);
killedBy: validateAccusation — A1a–A1e ok:true with every optional present and resolving
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] BlockStatement
src/accusation.ts:68:43
   // A1e: optional timeSlotId must resolve
   if (acc.timeSlotId !== undefined) {
     const timeSlotIds = new Set(cf.timeline.map((t) => t.id as string));
-    if (!timeSlotIds.has(acc.timeSlotId)) {
-      issues.push(CaseIssueCode.ACCUSED_TIMESLOT_RESOLVES);
-    }
+    if (!timeSlotIds.has(acc.timeSlotId)) {}
   }
 
killedBy: validateAccusation — A1a–A1e A1e: ACCUSED_TIMESLOT_RESOLVES on unknown timeSlotId
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/accusation.ts:68:9
   // A1e: optional timeSlotId must resolve
   if (acc.timeSlotId !== undefined) {
     const timeSlotIds = new Set(cf.timeline.map((t) => t.id as string));
-    if (!timeSlotIds.has(acc.timeSlotId)) {
+    if (timeSlotIds.has(acc.timeSlotId)) {
       issues.push(CaseIssueCode.ACCUSED_TIMESLOT_RESOLVES);
     }
killedBy: validateAccusation — A1a–A1e ok:true with every optional present and resolving
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, issues: [] }

[Killed] EqualityOperator
src/accusation.ts:73:16
     }
   }
 
-  return { ok: issues.length === 0, issues };
+  return { ok: issues.length !== 0, issues };
 }
 
killedBy: validateAccusation — A1a–A1e ok:true with no optional fields (all optional branches skipped)
statusReason: expected { ok: false, issues: [] } to deeply equal { ok: true, issues: [] }

[Killed] ConditionalExpression
src/accusation.ts:73:16
     }
   }
 
-  return { ok: issues.length === 0, issues };
+  return { ok: true, issues };
 }
 
killedBy: validateAccusation — A1a–A1e A1a: ACCUSATION_CASE_MISMATCH on wrong caseId
statusReason: expected true to be false // Object.is equality
