[Killed] BlockStatement
src/refinements.ts:41:95
 // Helpers
 // ---------------------------------------------------------------------------
 
-function addIssue(ctx: z.RefinementCtx, code: CaseIssueCode, path: (string | number)[]): void {
-  ctx.addIssue({
-    code: z.ZodIssueCode.custom,
-    path,
-    message: code,
-  });
-}
+function addIssue(ctx: z.RefinementCtx, code: CaseIssueCode, path: (string | number)[]): void {}
 
 /** Collect duplicate ids from an array; return paths of duplicates. */
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:53:28
 function findDuplicateIds<T extends { id: string }>(
   items: T[],
   prefix: string,
-): Array<[string, number]> {
-  const seen = new Set<string>();
-  const dupes: Array<[string, number]> = [];
-  for (let i = 0; i < items.length; i++) {
-    const item = items[i];
-    if (item === undefined) continue;
-    if (seen.has(item.id)) {
-      dupes.push([prefix, i]);
-    } else {
-      seen.add(item.id);
-    }
-  }
-  return dupes;
-}
+): Array<[string, number]> {}
 
 function buildIdSet<T extends { id: string }>(items: T[]): Set<string> {
killedBy: valid fixture parses clean (no issues)
statusReason: findDuplicateIds is not a function or its return value is not iterable

[Killed] BlockStatement
src/refinements.ts:56:42
 ): Array<[string, number]> {
   const seen = new Set<string>();
   const dupes: Array<[string, number]> = [];
-  for (let i = 0; i < items.length; i++) {
-    const item = items[i];
-    if (item === undefined) continue;
-    if (seen.has(item.id)) {
-      dupes.push([prefix, i]);
-    } else {
-      seen.add(item.id);
-    }
-  }
+  for (let i = 0; i < items.length; i++) {}
   return dupes;
 }
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] EqualityOperator
src/refinements.ts:56:19
 ): Array<[string, number]> {
   const seen = new Set<string>();
   const dupes: Array<[string, number]> = [];
-  for (let i = 0; i < items.length; i++) {
+  for (let i = 0; i >= items.length; i++) {
     const item = items[i];
     if (item === undefined) continue;
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] EqualityOperator
src/refinements.ts:58:9
   const dupes: Array<[string, number]> = [];
   for (let i = 0; i < items.length; i++) {
     const item = items[i];
-    if (item === undefined) continue;
+    if (item !== undefined) continue;
     if (seen.has(item.id)) {
       dupes.push([prefix, i]);
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:58:9
   const dupes: Array<[string, number]> = [];
   for (let i = 0; i < items.length; i++) {
     const item = items[i];
-    if (item === undefined) continue;
+    if (true) continue;
     if (seen.has(item.id)) {
       dupes.push([prefix, i]);
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:59:9
   for (let i = 0; i < items.length; i++) {
     const item = items[i];
     if (item === undefined) continue;
-    if (seen.has(item.id)) {
+    if (false) {
       dupes.push([prefix, i]);
     } else {
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:59:28
   for (let i = 0; i < items.length; i++) {
     const item = items[i];
     if (item === undefined) continue;
-    if (seen.has(item.id)) {
-      dupes.push([prefix, i]);
-    } else {
+    if (seen.has(item.id)) {} else {
       seen.add(item.id);
     }
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:61:12
     if (item === undefined) continue;
     if (seen.has(item.id)) {
       dupes.push([prefix, i]);
-    } else {
-      seen.add(item.id);
-    }
+    } else {}
   }
   return dupes;
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:68:72
   return dupes;
 }
 
-function buildIdSet<T extends { id: string }>(items: T[]): Set<string> {
-  return new Set(items.map((x) => x.id));
-}
+function buildIdSet<T extends { id: string }>(items: T[]): Set<string> {}
 
 // ---------------------------------------------------------------------------
killedBy: valid fixture parses clean (no issues)
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] ArrowFunction
src/refinements.ts:69:28
 }
 
 function buildIdSet<T extends { id: string }>(items: T[]): Set<string> {
-  return new Set(items.map((x) => x.id));
+  return new Set(items.map(() => undefined));
 }
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/refinements.ts:87:75
   // R1a–R1e: uniqueness of catalog ids
   // -------------------------------------------------------------------------
 
-  for (const [prefix, idx] of findDuplicateIds(val.suspects, 'suspects')) {
-    addIssue(ctx, CaseIssueCode.DUP_SUSPECT_ID, [prefix, idx, 'id']);
-  }
+  for (const [prefix, idx] of findDuplicateIds(val.suspects, 'suspects')) {}
   for (const [prefix, idx] of findDuplicateIds(val.weapons, 'weapons')) {
     addIssue(ctx, CaseIssueCode.DUP_WEAPON_ID, [prefix, idx, 'id']);
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected issue DUP_SUSPECT_ID to fire: expected [] to not have a length of +0

[Killed] StringLiteral
src/refinements.ts:87:62
   // R1a–R1e: uniqueness of catalog ids
   // -------------------------------------------------------------------------
 
-  for (const [prefix, idx] of findDuplicateIds(val.suspects, 'suspects')) {
+  for (const [prefix, idx] of findDuplicateIds(val.suspects, "")) {
     addIssue(ctx, CaseIssueCode.DUP_SUSPECT_ID, [prefix, idx, 'id']);
   }
killedBy: R1 — catalog id uniqueness R1a: fires DUP_SUSPECT_ID at the duplicate index
statusReason: expected [ [ '', 1, 'id' ] ] to deep equally contain [ 'suspects', 1, 'id' ]

[Killed] BlockStatement
src/refinements.ts:90:73
   for (const [prefix, idx] of findDuplicateIds(val.suspects, 'suspects')) {
     addIssue(ctx, CaseIssueCode.DUP_SUSPECT_ID, [prefix, idx, 'id']);
   }
-  for (const [prefix, idx] of findDuplicateIds(val.weapons, 'weapons')) {
-    addIssue(ctx, CaseIssueCode.DUP_WEAPON_ID, [prefix, idx, 'id']);
-  }
+  for (const [prefix, idx] of findDuplicateIds(val.weapons, 'weapons')) {}
   for (const [prefix, idx] of findDuplicateIds(val.locations, 'locations')) {
     addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, [prefix, idx, 'id']);
killedBy: R1 — catalog id uniqueness R1b: fires DUP_WEAPON_ID
statusReason: expected issue DUP_WEAPON_ID to fire: expected [] to not have a length of +0

[Killed] StringLiteral
src/refinements.ts:90:61
   for (const [prefix, idx] of findDuplicateIds(val.suspects, 'suspects')) {
     addIssue(ctx, CaseIssueCode.DUP_SUSPECT_ID, [prefix, idx, 'id']);
   }
-  for (const [prefix, idx] of findDuplicateIds(val.weapons, 'weapons')) {
+  for (const [prefix, idx] of findDuplicateIds(val.weapons, "")) {
     addIssue(ctx, CaseIssueCode.DUP_WEAPON_ID, [prefix, idx, 'id']);
   }
killedBy: R1 — catalog id uniqueness R1b: fires DUP_WEAPON_ID
statusReason: expected [ [ '', 1, 'id' ] ] to deep equally contain [ 'weapons', 1, 'id' ]

[Killed] ArrayDeclaration
src/refinements.ts:91:48
     addIssue(ctx, CaseIssueCode.DUP_SUSPECT_ID, [prefix, idx, 'id']);
   }
   for (const [prefix, idx] of findDuplicateIds(val.weapons, 'weapons')) {
-    addIssue(ctx, CaseIssueCode.DUP_WEAPON_ID, [prefix, idx, 'id']);
+    addIssue(ctx, CaseIssueCode.DUP_WEAPON_ID, []);
   }
   for (const [prefix, idx] of findDuplicateIds(val.locations, 'locations')) {
killedBy: R1 — catalog id uniqueness R1b: fires DUP_WEAPON_ID
statusReason: expected [ [] ] to deep equally contain [ 'weapons', 1, 'id' ]

[Killed] BlockStatement
src/refinements.ts:93:77
   for (const [prefix, idx] of findDuplicateIds(val.weapons, 'weapons')) {
     addIssue(ctx, CaseIssueCode.DUP_WEAPON_ID, [prefix, idx, 'id']);
   }
-  for (const [prefix, idx] of findDuplicateIds(val.locations, 'locations')) {
-    addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, [prefix, idx, 'id']);
-  }
+  for (const [prefix, idx] of findDuplicateIds(val.locations, 'locations')) {}
   for (const [prefix, idx] of findDuplicateIds(val.timeline, 'timeline')) {
     addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, [prefix, idx, 'id']);
killedBy: R1 — catalog id uniqueness R1c: fires DUP_LOCATION_ID
statusReason: expected issue DUP_LOCATION_ID to fire: expected [] to not have a length of +0

[Killed] StringLiteral
src/refinements.ts:93:63
   for (const [prefix, idx] of findDuplicateIds(val.weapons, 'weapons')) {
     addIssue(ctx, CaseIssueCode.DUP_WEAPON_ID, [prefix, idx, 'id']);
   }
-  for (const [prefix, idx] of findDuplicateIds(val.locations, 'locations')) {
+  for (const [prefix, idx] of findDuplicateIds(val.locations, "")) {
     addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, [prefix, idx, 'id']);
   }
killedBy: R1 — catalog id uniqueness R1c: fires DUP_LOCATION_ID
statusReason: expected [ [ '', 1, 'id' ] ] to deep equally contain [ 'locations', 1, 'id' ]

[Killed] ArrayDeclaration
src/refinements.ts:94:50
     addIssue(ctx, CaseIssueCode.DUP_WEAPON_ID, [prefix, idx, 'id']);
   }
   for (const [prefix, idx] of findDuplicateIds(val.locations, 'locations')) {
-    addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, [prefix, idx, 'id']);
+    addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, []);
   }
   for (const [prefix, idx] of findDuplicateIds(val.timeline, 'timeline')) {
killedBy: R1 — catalog id uniqueness R1c: fires DUP_LOCATION_ID
statusReason: expected [ [] ] to deep equally contain [ 'locations', 1, 'id' ]

[Killed] BlockStatement
src/refinements.ts:96:75
   for (const [prefix, idx] of findDuplicateIds(val.locations, 'locations')) {
     addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, [prefix, idx, 'id']);
   }
-  for (const [prefix, idx] of findDuplicateIds(val.timeline, 'timeline')) {
-    addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, [prefix, idx, 'id']);
-  }
+  for (const [prefix, idx] of findDuplicateIds(val.timeline, 'timeline')) {}
   for (const [prefix, idx] of findDuplicateIds(val.clues, 'clues')) {
     addIssue(ctx, CaseIssueCode.DUP_CLUE_ID, [prefix, idx, 'id']);
killedBy: R1 — catalog id uniqueness R1d: fires DUP_TIMESLOT_ID
statusReason: expected issue DUP_TIMESLOT_ID to fire: expected [] to not have a length of +0

[Killed] StringLiteral
src/refinements.ts:96:62
   for (const [prefix, idx] of findDuplicateIds(val.locations, 'locations')) {
     addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, [prefix, idx, 'id']);
   }
-  for (const [prefix, idx] of findDuplicateIds(val.timeline, 'timeline')) {
+  for (const [prefix, idx] of findDuplicateIds(val.timeline, "")) {
     addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, [prefix, idx, 'id']);
   }
killedBy: R1 — catalog id uniqueness R1d: fires DUP_TIMESLOT_ID
statusReason: expected [ [ '', 1, 'id' ] ] to deep equally contain [ 'timeline', 1, 'id' ]

[Killed] ArrayDeclaration
src/refinements.ts:97:50
     addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, [prefix, idx, 'id']);
   }
   for (const [prefix, idx] of findDuplicateIds(val.timeline, 'timeline')) {
-    addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, [prefix, idx, 'id']);
+    addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, []);
   }
   for (const [prefix, idx] of findDuplicateIds(val.clues, 'clues')) {
killedBy: R1 — catalog id uniqueness R1d: fires DUP_TIMESLOT_ID
statusReason: expected [ [] ] to deep equally contain [ 'timeline', 1, 'id' ]

[Killed] StringLiteral
src/refinements.ts:97:64
     addIssue(ctx, CaseIssueCode.DUP_LOCATION_ID, [prefix, idx, 'id']);
   }
   for (const [prefix, idx] of findDuplicateIds(val.timeline, 'timeline')) {
-    addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, [prefix, idx, 'id']);
+    addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, [prefix, idx, ""]);
   }
   for (const [prefix, idx] of findDuplicateIds(val.clues, 'clues')) {
killedBy: R1 — catalog id uniqueness R1d: fires DUP_TIMESLOT_ID
statusReason: expected [ [ 'timeline', 1, '' ] ] to deep equally contain [ 'timeline', 1, 'id' ]

[Killed] BlockStatement
src/refinements.ts:99:69
   for (const [prefix, idx] of findDuplicateIds(val.timeline, 'timeline')) {
     addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, [prefix, idx, 'id']);
   }
-  for (const [prefix, idx] of findDuplicateIds(val.clues, 'clues')) {
-    addIssue(ctx, CaseIssueCode.DUP_CLUE_ID, [prefix, idx, 'id']);
-  }
+  for (const [prefix, idx] of findDuplicateIds(val.clues, 'clues')) {}
 
   // -------------------------------------------------------------------------
killedBy: R1 — catalog id uniqueness R1e: fires DUP_CLUE_ID
statusReason: expected issue DUP_CLUE_ID to fire: expected [] to not have a length of +0

[Killed] StringLiteral
src/refinements.ts:100:60
     addIssue(ctx, CaseIssueCode.DUP_TIMESLOT_ID, [prefix, idx, 'id']);
   }
   for (const [prefix, idx] of findDuplicateIds(val.clues, 'clues')) {
-    addIssue(ctx, CaseIssueCode.DUP_CLUE_ID, [prefix, idx, 'id']);
+    addIssue(ctx, CaseIssueCode.DUP_CLUE_ID, [prefix, idx, ""]);
   }
 
killedBy: R1 — catalog id uniqueness R1e: fires DUP_CLUE_ID
statusReason: expected [ [ 'clues', 1, '' ] ] to deep equally contain [ 'clues', 1, 'id' ]

[Killed] ConditionalExpression
src/refinements.ts:107:47
   // R2: exactly one suspect with role === 'culprit'
   // -------------------------------------------------------------------------
 
-  const culprits = val.suspects.filter((s) => s.role === 'culprit');
+  const culprits = val.suspects.filter((s) => false);
   if (culprits.length !== 1) {
     addIssue(ctx, CaseIssueCode.EXACTLY_ONE_CULPRIT, ['suspects']);
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/refinements.ts:107:20
   // R2: exactly one suspect with role === 'culprit'
   // -------------------------------------------------------------------------
 
-  const culprits = val.suspects.filter((s) => s.role === 'culprit');
+  const culprits = val.suspects;
   if (culprits.length !== 1) {
     addIssue(ctx, CaseIssueCode.EXACTLY_ONE_CULPRIT, ['suspects']);
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/refinements.ts:108:30
   // -------------------------------------------------------------------------
 
   const culprits = val.suspects.filter((s) => s.role === 'culprit');
-  if (culprits.length !== 1) {
-    addIssue(ctx, CaseIssueCode.EXACTLY_ONE_CULPRIT, ['suspects']);
-  }
+  if (culprits.length !== 1) {}
 
   // -------------------------------------------------------------------------
killedBy: R2 — exactly one culprit fires when 0 culprits
statusReason: expected issue EXACTLY_ONE_CULPRIT to fire: expected [] to not have a length of +0

[Killed] EqualityOperator
src/refinements.ts:108:7
   // -------------------------------------------------------------------------
 
   const culprits = val.suspects.filter((s) => s.role === 'culprit');
-  if (culprits.length !== 1) {
+  if (culprits.length === 1) {
     addIssue(ctx, CaseIssueCode.EXACTLY_ONE_CULPRIT, ['suspects']);
   }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/refinements.ts:109:55
 
   const culprits = val.suspects.filter((s) => s.role === 'culprit');
   if (culprits.length !== 1) {
-    addIssue(ctx, CaseIssueCode.EXACTLY_ONE_CULPRIT, ['suspects']);
+    addIssue(ctx, CaseIssueCode.EXACTLY_ONE_CULPRIT, [""]);
   }
 
killedBy: R2 — exactly one culprit fires when 0 culprits
statusReason: expected [ [ '' ] ] to deep equally contain [ 'suspects' ]

[Killed] ArrayDeclaration
src/refinements.ts:109:54
 
   const culprits = val.suspects.filter((s) => s.role === 'culprit');
   if (culprits.length !== 1) {
-    addIssue(ctx, CaseIssueCode.EXACTLY_ONE_CULPRIT, ['suspects']);
+    addIssue(ctx, CaseIssueCode.EXACTLY_ONE_CULPRIT, []);
   }
 
killedBy: R2 — exactly one culprit fires when 0 culprits
statusReason: expected [ [] ] to deep equally contain [ 'suspects' ]

[Killed] ConditionalExpression
src/refinements.ts:116:19
   // R3: isGuilty ⟺ role === 'culprit' for every suspect
   // -------------------------------------------------------------------------
 
-  for (let i = 0; i < val.suspects.length; i++) {
+  for (let i = 0; false; i++) {
     const s = val.suspects[i];
     if (s === undefined) continue;
killedBy: R3 — isGuilty ⟺ role==="culprit" fires on guilty witness at that suspect
statusReason: expected issue GUILT_ROLE_COHERENT to fire: expected [] to not have a length of +0

[Killed] EqualityOperator
src/refinements.ts:116:19
   // R3: isGuilty ⟺ role === 'culprit' for every suspect
   // -------------------------------------------------------------------------
 
-  for (let i = 0; i < val.suspects.length; i++) {
+  for (let i = 0; i >= val.suspects.length; i++) {
     const s = val.suspects[i];
     if (s === undefined) continue;
killedBy: R3 — isGuilty ⟺ role==="culprit" fires on guilty witness at that suspect
statusReason: expected issue GUILT_ROLE_COHERENT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:118:9
 
   for (let i = 0; i < val.suspects.length; i++) {
     const s = val.suspects[i];
-    if (s === undefined) continue;
+    if (false) continue;
     const coherent = s.isGuilty === (s.role === 'culprit');
     if (!coherent) {
killedBy: defensive guards (sparse/degenerate input) tolerates holes at every array level without throwing
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/refinements.ts:118:9
 
   for (let i = 0; i < val.suspects.length; i++) {
     const s = val.suspects[i];
-    if (s === undefined) continue;
+    if (true) continue;
     const coherent = s.isGuilty === (s.role === 'culprit');
     if (!coherent) {
killedBy: R3 — isGuilty ⟺ role==="culprit" fires on guilty witness at that suspect
statusReason: expected issue GUILT_ROLE_COHERENT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:119:38
   for (let i = 0; i < val.suspects.length; i++) {
     const s = val.suspects[i];
     if (s === undefined) continue;
-    const coherent = s.isGuilty === (s.role === 'culprit');
+    const coherent = s.isGuilty === (true);
     if (!coherent) {
       addIssue(ctx, CaseIssueCode.GUILT_ROLE_COHERENT, ['suspects', i, 'isGuilty']);
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:119:38
   for (let i = 0; i < val.suspects.length; i++) {
     const s = val.suspects[i];
     if (s === undefined) continue;
-    const coherent = s.isGuilty === (s.role === 'culprit');
+    const coherent = s.isGuilty === (false);
     if (!coherent) {
       addIssue(ctx, CaseIssueCode.GUILT_ROLE_COHERENT, ['suspects', i, 'isGuilty']);
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:120:9
     const s = val.suspects[i];
     if (s === undefined) continue;
     const coherent = s.isGuilty === (s.role === 'culprit');
-    if (!coherent) {
+    if (false) {
       addIssue(ctx, CaseIssueCode.GUILT_ROLE_COHERENT, ['suspects', i, 'isGuilty']);
     }
killedBy: R3 — isGuilty ⟺ role==="culprit" fires on guilty witness at that suspect
statusReason: expected issue GUILT_ROLE_COHERENT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:120:9
     const s = val.suspects[i];
     if (s === undefined) continue;
     const coherent = s.isGuilty === (s.role === 'culprit');
-    if (!coherent) {
+    if (true) {
       addIssue(ctx, CaseIssueCode.GUILT_ROLE_COHERENT, ['suspects', i, 'isGuilty']);
     }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/refinements.ts:121:57
     if (s === undefined) continue;
     const coherent = s.isGuilty === (s.role === 'culprit');
     if (!coherent) {
-      addIssue(ctx, CaseIssueCode.GUILT_ROLE_COHERENT, ['suspects', i, 'isGuilty']);
+      addIssue(ctx, CaseIssueCode.GUILT_ROLE_COHERENT, ["", i, 'isGuilty']);
     }
   }
killedBy: R3 — isGuilty ⟺ role==="culprit" fires on guilty witness at that suspect
statusReason: expected [ [ '', 1, 'isGuilty' ] ] to deep equally contain [ 'suspects', 1, 'isGuilty' ]

[Killed] StringLiteral
src/refinements.ts:121:72
     if (s === undefined) continue;
     const coherent = s.isGuilty === (s.role === 'culprit');
     if (!coherent) {
-      addIssue(ctx, CaseIssueCode.GUILT_ROLE_COHERENT, ['suspects', i, 'isGuilty']);
+      addIssue(ctx, CaseIssueCode.GUILT_ROLE_COHERENT, ['suspects', i, ""]);
     }
   }
killedBy: R3 — isGuilty ⟺ role==="culprit" fires on guilty witness at that suspect
statusReason: expected [ [ 'suspects', 1, '' ] ] to deep equally contain [ 'suspects', 1, 'isGuilty' ]

[Killed] ConditionalExpression
src/refinements.ts:129:7
   // R4: victim.id must not also be a suspect id
   // -------------------------------------------------------------------------
 
-  if (suspectIds.has(val.victim.id)) {
+  if (true) {
     addIssue(ctx, CaseIssueCode.VICTIM_NOT_SUSPECT, ['victim', 'id']);
   }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:129:7
   // R4: victim.id must not also be a suspect id
   // -------------------------------------------------------------------------
 
-  if (suspectIds.has(val.victim.id)) {
+  if (false) {
     addIssue(ctx, CaseIssueCode.VICTIM_NOT_SUSPECT, ['victim', 'id']);
   }
killedBy: R4 — victim id not reused as suspect id fires when a suspect reuses the victim id
statusReason: expected issue VICTIM_NOT_SUSPECT to fire: expected [] to not have a length of +0

[Killed] ArrayDeclaration
src/refinements.ts:130:53
   // -------------------------------------------------------------------------
 
   if (suspectIds.has(val.victim.id)) {
-    addIssue(ctx, CaseIssueCode.VICTIM_NOT_SUSPECT, ['victim', 'id']);
+    addIssue(ctx, CaseIssueCode.VICTIM_NOT_SUSPECT, []);
   }
 
killedBy: R4 — victim id not reused as suspect id fires when a suspect reuses the victim id
statusReason: expected [ [] ] to deep equally contain [ 'victim', 'id' ]

[Killed] ConditionalExpression
src/refinements.ts:138:7
   // R5b: that suspect has role === 'culprit'
   // -------------------------------------------------------------------------
 
-  if (!suspectIds.has(val.solution.killerId)) {
+  if (true) {
     addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
   } else {
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/refinements.ts:138:7
   // R5b: that suspect has role === 'culprit'
   // -------------------------------------------------------------------------
 
-  if (!suspectIds.has(val.solution.killerId)) {
+  if (suspectIds.has(val.solution.killerId)) {
     addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
   } else {
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/refinements.ts:139:63
   // -------------------------------------------------------------------------
 
   if (!suspectIds.has(val.solution.killerId)) {
-    addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
+    addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', ""]);
   } else {
     const killer = val.suspects.find((s) => s.id === val.solution.killerId);
killedBy: R5 — solution killer resolves and is the culprit R5a: fires when killerId is unknown
statusReason: expected [ [ 'solution', '' ] ] to deep equally contain [ 'solution', 'killerId' ]

[Killed] StringLiteral
src/refinements.ts:139:51
   // -------------------------------------------------------------------------
 
   if (!suspectIds.has(val.solution.killerId)) {
-    addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
+    addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ["", 'killerId']);
   } else {
     const killer = val.suspects.find((s) => s.id === val.solution.killerId);
killedBy: R5 — solution killer resolves and is the culprit R5a: fires when killerId is unknown
statusReason: expected [ [ '', 'killerId' ] ] to deep equally contain [ 'solution', 'killerId' ]

[Killed] BlockStatement
src/refinements.ts:140:10
 
   if (!suspectIds.has(val.solution.killerId)) {
     addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
-  } else {
-    const killer = val.suspects.find((s) => s.id === val.solution.killerId);
-    if (killer !== undefined && killer.role !== 'culprit') {
-      addIssue(ctx, CaseIssueCode.KILLER_IS_CULPRIT, ['solution', 'killerId']);
-    }
-  }
+  } else {}
 
   // -------------------------------------------------------------------------
killedBy: R5 — solution killer resolves and is the culprit R5b: fires when killer resolves but is not the culprit
statusReason: expected issue KILLER_IS_CULPRIT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:141:45
   if (!suspectIds.has(val.solution.killerId)) {
     addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
   } else {
-    const killer = val.suspects.find((s) => s.id === val.solution.killerId);
+    const killer = val.suspects.find((s) => true);
     if (killer !== undefined && killer.role !== 'culprit') {
       addIssue(ctx, CaseIssueCode.KILLER_IS_CULPRIT, ['solution', 'killerId']);
killedBy: R5 — solution killer resolves and is the culprit R5b: fires when killer resolves but is not the culprit
statusReason: expected issue KILLER_IS_CULPRIT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:141:45
   if (!suspectIds.has(val.solution.killerId)) {
     addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
   } else {
-    const killer = val.suspects.find((s) => s.id === val.solution.killerId);
+    const killer = val.suspects.find((s) => false);
     if (killer !== undefined && killer.role !== 'culprit') {
       addIssue(ctx, CaseIssueCode.KILLER_IS_CULPRIT, ['solution', 'killerId']);
killedBy: R5 — solution killer resolves and is the culprit R5b: fires when killer resolves but is not the culprit
statusReason: expected issue KILLER_IS_CULPRIT to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:142:60
     addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
   } else {
     const killer = val.suspects.find((s) => s.id === val.solution.killerId);
-    if (killer !== undefined && killer.role !== 'culprit') {
-      addIssue(ctx, CaseIssueCode.KILLER_IS_CULPRIT, ['solution', 'killerId']);
-    }
+    if (killer !== undefined && killer.role !== 'culprit') {}
   }
 
killedBy: R5 — solution killer resolves and is the culprit R5b: fires when killer resolves but is not the culprit
statusReason: expected issue KILLER_IS_CULPRIT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:142:33
     addIssue(ctx, CaseIssueCode.KILLER_RESOLVES, ['solution', 'killerId']);
   } else {
     const killer = val.suspects.find((s) => s.id === val.solution.killerId);
-    if (killer !== undefined && killer.role !== 'culprit') {
+    if (killer !== undefined && true) {
       addIssue(ctx, CaseIssueCode.KILLER_IS_CULPRIT, ['solution', 'killerId']);
     }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/refinements.ts:152:7
   // R6b–R6d: weapon/location/timeSlot resolve against catalogs
   // -------------------------------------------------------------------------
 
-  if (val.solution.victimId !== val.victim.id) {
+  if (val.solution.victimId === val.victim.id) {
     addIssue(ctx, CaseIssueCode.SOLUTION_VICTIM_MATCHES, ['solution', 'victimId']);
   }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality
