[Killed] ConditionalExpression
src/refinements.ts:152:7
   // R6b–R6d: weapon/location/timeSlot resolve against catalogs
   // -------------------------------------------------------------------------
 
-  if (val.solution.victimId !== val.victim.id) {
+  if (true) {
     addIssue(ctx, CaseIssueCode.SOLUTION_VICTIM_MATCHES, ['solution', 'victimId']);
   }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/refinements.ts:153:59
   // -------------------------------------------------------------------------
 
   if (val.solution.victimId !== val.victim.id) {
-    addIssue(ctx, CaseIssueCode.SOLUTION_VICTIM_MATCHES, ['solution', 'victimId']);
+    addIssue(ctx, CaseIssueCode.SOLUTION_VICTIM_MATCHES, ["", 'victimId']);
   }
   if (!weaponIds.has(val.solution.weaponId)) {
killedBy: R6 — solution references resolve R6a: fires on victim mismatch
statusReason: expected [ [ '', 'victimId' ] ] to deep equally contain [ 'solution', 'victimId' ]

[Killed] BlockStatement
src/refinements.ts:155:46
   if (val.solution.victimId !== val.victim.id) {
     addIssue(ctx, CaseIssueCode.SOLUTION_VICTIM_MATCHES, ['solution', 'victimId']);
   }
-  if (!weaponIds.has(val.solution.weaponId)) {
-    addIssue(ctx, CaseIssueCode.SOLUTION_WEAPON_RESOLVES, ['solution', 'weaponId']);
-  }
+  if (!weaponIds.has(val.solution.weaponId)) {}
   if (!locationIds.has(val.solution.locationId)) {
     addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, ['solution', 'locationId']);
killedBy: R6 — solution references resolve R6b: fires on unknown weapon
statusReason: expected issue SOLUTION_WEAPON_RESOLVES to fire: expected [] to not have a length of +0

[Killed] BooleanLiteral
src/refinements.ts:155:7
   if (val.solution.victimId !== val.victim.id) {
     addIssue(ctx, CaseIssueCode.SOLUTION_VICTIM_MATCHES, ['solution', 'victimId']);
   }
-  if (!weaponIds.has(val.solution.weaponId)) {
+  if (weaponIds.has(val.solution.weaponId)) {
     addIssue(ctx, CaseIssueCode.SOLUTION_WEAPON_RESOLVES, ['solution', 'weaponId']);
   }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/refinements.ts:158:50
   if (!weaponIds.has(val.solution.weaponId)) {
     addIssue(ctx, CaseIssueCode.SOLUTION_WEAPON_RESOLVES, ['solution', 'weaponId']);
   }
-  if (!locationIds.has(val.solution.locationId)) {
-    addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, ['solution', 'locationId']);
-  }
+  if (!locationIds.has(val.solution.locationId)) {}
   if (!timeSlotIds.has(val.solution.timeSlotId)) {
     addIssue(ctx, CaseIssueCode.SOLUTION_TIMESLOT_RESOLVES, ['solution', 'timeSlotId']);
killedBy: R6 — solution references resolve R6c: fires on unknown location
statusReason: expected issue SOLUTION_LOCATION_RESOLVES to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:158:7
   if (!weaponIds.has(val.solution.weaponId)) {
     addIssue(ctx, CaseIssueCode.SOLUTION_WEAPON_RESOLVES, ['solution', 'weaponId']);
   }
-  if (!locationIds.has(val.solution.locationId)) {
+  if (true) {
     addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, ['solution', 'locationId']);
   }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/refinements.ts:159:61
     addIssue(ctx, CaseIssueCode.SOLUTION_WEAPON_RESOLVES, ['solution', 'weaponId']);
   }
   if (!locationIds.has(val.solution.locationId)) {
-    addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, ['solution', 'locationId']);
+    addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, []);
   }
   if (!timeSlotIds.has(val.solution.timeSlotId)) {
killedBy: R6 — solution references resolve R6c: fires on unknown location
statusReason: expected [ [] ] to deep equally contain [ 'solution', 'locationId' ]

[Killed] StringLiteral
src/refinements.ts:159:74
     addIssue(ctx, CaseIssueCode.SOLUTION_WEAPON_RESOLVES, ['solution', 'weaponId']);
   }
   if (!locationIds.has(val.solution.locationId)) {
-    addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, ['solution', 'locationId']);
+    addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, ['solution', ""]);
   }
   if (!timeSlotIds.has(val.solution.timeSlotId)) {
killedBy: R6 — solution references resolve R6c: fires on unknown location
statusReason: expected [ [ 'solution', '' ] ] to deep equally contain [ 'solution', 'locationId' ]

[Killed] ConditionalExpression
src/refinements.ts:161:7
   if (!locationIds.has(val.solution.locationId)) {
     addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, ['solution', 'locationId']);
   }
-  if (!timeSlotIds.has(val.solution.timeSlotId)) {
+  if (false) {
     addIssue(ctx, CaseIssueCode.SOLUTION_TIMESLOT_RESOLVES, ['solution', 'timeSlotId']);
   }
killedBy: R6 — solution references resolve R6d: fires on unknown timeslot
statusReason: expected issue SOLUTION_TIMESLOT_RESOLVES to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:161:7
   if (!locationIds.has(val.solution.locationId)) {
     addIssue(ctx, CaseIssueCode.SOLUTION_LOCATION_RESOLVES, ['solution', 'locationId']);
   }
-  if (!timeSlotIds.has(val.solution.timeSlotId)) {
+  if (true) {
     addIssue(ctx, CaseIssueCode.SOLUTION_TIMESLOT_RESOLVES, ['solution', 'timeSlotId']);
   }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/refinements.ts:169:20
   // Per-suspect invariants (R7–R10, R11, R12, R16)
   // -------------------------------------------------------------------------
 
-  for (let si = 0; si < val.suspects.length; si++) {
+  for (let si = 0; si >= val.suspects.length; si++) {
     const s = val.suspects[si];
     if (s === undefined) continue;
killedBy: R7–R9 — three-tier knowledge R7: fires when knows ∩ doesNotKnow ≠ ∅
statusReason: expected issue KNOWLEDGE_DISJOINT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:169:20
   // Per-suspect invariants (R7–R10, R11, R12, R16)
   // -------------------------------------------------------------------------
 
-  for (let si = 0; si < val.suspects.length; si++) {
+  for (let si = 0; false; si++) {
     const s = val.suspects[si];
     if (s === undefined) continue;
killedBy: R7–R9 — three-tier knowledge R7: fires when knows ∩ doesNotKnow ≠ ∅
statusReason: expected issue KNOWLEDGE_DISJOINT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:171:9
 
   for (let si = 0; si < val.suspects.length; si++) {
     const s = val.suspects[si];
-    if (s === undefined) continue;
+    if (false) continue;
 
     const knowsSet = new Set(s.knowledge.knows);
killedBy: defensive guards (sparse/degenerate input) tolerates holes at every array level without throwing
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] EqualityOperator
src/refinements.ts:171:9
 
   for (let si = 0; si < val.suspects.length; si++) {
     const s = val.suspects[si];
-    if (s === undefined) continue;
+    if (s !== undefined) continue;
 
     const knowsSet = new Set(s.knowledge.knows);
killedBy: R7–R9 — three-tier knowledge R7: fires when knows ∩ doesNotKnow ≠ ∅
statusReason: expected issue KNOWLEDGE_DISJOINT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:178:22
 
     // R7: knows ∩ doesNotKnow === ∅
     const knowledgeViolations: number[] = [];
-    for (let ki = 0; ki < s.knowledge.doesNotKnow.length; ki++) {
+    for (let ki = 0; false; ki++) {
       const fact = s.knowledge.doesNotKnow[ki];
       if (fact !== undefined && knowsSet.has(fact)) {
killedBy: R7–R9 — three-tier knowledge R7: fires when knows ∩ doesNotKnow ≠ ∅
statusReason: expected issue KNOWLEDGE_DISJOINT to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:178:65
 
     // R7: knows ∩ doesNotKnow === ∅
     const knowledgeViolations: number[] = [];
-    for (let ki = 0; ki < s.knowledge.doesNotKnow.length; ki++) {
-      const fact = s.knowledge.doesNotKnow[ki];
-      if (fact !== undefined && knowsSet.has(fact)) {
-        knowledgeViolations.push(ki);
-      }
-    }
+    for (let ki = 0; ki < s.knowledge.doesNotKnow.length; ki++) {}
     for (const ki of knowledgeViolations) {
       addIssue(ctx, CaseIssueCode.KNOWLEDGE_DISJOINT, [
killedBy: R7–R9 — three-tier knowledge R7: fires when knows ∩ doesNotKnow ≠ ∅
statusReason: expected issue KNOWLEDGE_DISJOINT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:180:11
     const knowledgeViolations: number[] = [];
     for (let ki = 0; ki < s.knowledge.doesNotKnow.length; ki++) {
       const fact = s.knowledge.doesNotKnow[ki];
-      if (fact !== undefined && knowsSet.has(fact)) {
+      if (true) {
         knowledgeViolations.push(ki);
       }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:180:11
     const knowledgeViolations: number[] = [];
     for (let ki = 0; ki < s.knowledge.doesNotKnow.length; ki++) {
       const fact = s.knowledge.doesNotKnow[ki];
-      if (fact !== undefined && knowsSet.has(fact)) {
+      if (true && knowsSet.has(fact)) {
         knowledgeViolations.push(ki);
       }
killedBy: defensive guards (sparse/degenerate input) treats holes as skips, not violations (sparse knows → R7 guard is load-bearing)
statusReason: expected [ 'KILLER_RESOLVES', …(2) ] to not include 'KNOWLEDGE_DISJOINT'

[Killed] BlockStatement
src/refinements.ts:184:43
         knowledgeViolations.push(ki);
       }
     }
-    for (const ki of knowledgeViolations) {
-      addIssue(ctx, CaseIssueCode.KNOWLEDGE_DISJOINT, [
-        'suspects',
-        si,
-        'knowledge',
-        'doesNotKnow',
-        ki,
-      ]);
-    }
+    for (const ki of knowledgeViolations) {}
 
     // R8: knownFacts ⊆ knows
killedBy: R7–R9 — three-tier knowledge R7: fires when knows ∩ doesNotKnow ≠ ∅
statusReason: expected issue KNOWLEDGE_DISJOINT to fire: expected [] to not have a length of +0

[Killed] ArrayDeclaration
src/refinements.ts:185:55
       }
     }
     for (const ki of knowledgeViolations) {
-      addIssue(ctx, CaseIssueCode.KNOWLEDGE_DISJOINT, [
-        'suspects',
-        si,
-        'knowledge',
-        'doesNotKnow',
-        ki,
-      ]);
+      addIssue(ctx, CaseIssueCode.KNOWLEDGE_DISJOINT, []);
     }
 
killedBy: R7–R9 — three-tier knowledge R7: fires when knows ∩ doesNotKnow ≠ ∅
statusReason: expected [ [] ] to deep equally contain [ 'suspects', +0, 'knowledge', …(2) ]

[Killed] ArrayDeclaration
src/refinements.ts:195:44
     }
 
     // R8: knownFacts ⊆ knows
-    const knownFactsViolations: number[] = [];
+    const knownFactsViolations: number[] = ["Stryker was here"];
     for (let kfi = 0; kfi < s.knownFacts.length; kfi++) {
       const fact = s.knownFacts[kfi];
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/refinements.ts:196:23
 
     // R8: knownFacts ⊆ knows
     const knownFactsViolations: number[] = [];
-    for (let kfi = 0; kfi < s.knownFacts.length; kfi++) {
+    for (let kfi = 0; kfi >= s.knownFacts.length; kfi++) {
       const fact = s.knownFacts[kfi];
       if (fact !== undefined && !knowsSet.has(fact)) {
killedBy: R7–R9 — three-tier knowledge R8: fires when a knownFact is not in knows
statusReason: expected issue KNOWN_FACTS_SUBSET to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:196:23
 
     // R8: knownFacts ⊆ knows
     const knownFactsViolations: number[] = [];
-    for (let kfi = 0; kfi < s.knownFacts.length; kfi++) {
+    for (let kfi = 0; false; kfi++) {
       const fact = s.knownFacts[kfi];
       if (fact !== undefined && !knowsSet.has(fact)) {
killedBy: R7–R9 — three-tier knowledge R8: fires when a knownFact is not in knows
statusReason: expected issue KNOWN_FACTS_SUBSET to fire: expected [] to not have a length of +0

[Killed] LogicalOperator
src/refinements.ts:198:11
     const knownFactsViolations: number[] = [];
     for (let kfi = 0; kfi < s.knownFacts.length; kfi++) {
       const fact = s.knownFacts[kfi];
-      if (fact !== undefined && !knowsSet.has(fact)) {
+      if (fact !== undefined || !knowsSet.has(fact)) {
         knownFactsViolations.push(kfi);
       }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:198:11
     const knownFactsViolations: number[] = [];
     for (let kfi = 0; kfi < s.knownFacts.length; kfi++) {
       const fact = s.knownFacts[kfi];
-      if (fact !== undefined && !knowsSet.has(fact)) {
+      if (false) {
         knownFactsViolations.push(kfi);
       }
killedBy: R7–R9 — three-tier knowledge R8: fires when a knownFact is not in knows
statusReason: expected issue KNOWN_FACTS_SUBSET to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:202:45
         knownFactsViolations.push(kfi);
       }
     }
-    for (const kfi of knownFactsViolations) {
-      addIssue(ctx, CaseIssueCode.KNOWN_FACTS_SUBSET, ['suspects', si, 'knownFacts', kfi]);
-    }
+    for (const kfi of knownFactsViolations) {}
 
     // R9: each secret.fact ∈ knows ∧ ∉ knownFacts
killedBy: R7–R9 — three-tier knowledge R8: fires when a knownFact is not in knows
statusReason: expected issue KNOWN_FACTS_SUBSET to fire: expected [] to not have a length of +0

[Killed] StringLiteral
src/refinements.ts:203:72
       }
     }
     for (const kfi of knownFactsViolations) {
-      addIssue(ctx, CaseIssueCode.KNOWN_FACTS_SUBSET, ['suspects', si, 'knownFacts', kfi]);
+      addIssue(ctx, CaseIssueCode.KNOWN_FACTS_SUBSET, ['suspects', si, "", kfi]);
     }
 
killedBy: R7–R9 — three-tier knowledge R8: fires when a knownFact is not in knows
statusReason: expected [ [ 'suspects', +0, '', +0 ] ] to deep equally contain [ 'suspects', +0, 'knownFacts', +0 ]

[Killed] StringLiteral
src/refinements.ts:203:56
       }
     }
     for (const kfi of knownFactsViolations) {
-      addIssue(ctx, CaseIssueCode.KNOWN_FACTS_SUBSET, ['suspects', si, 'knownFacts', kfi]);
+      addIssue(ctx, CaseIssueCode.KNOWN_FACTS_SUBSET, ["", si, 'knownFacts', kfi]);
     }
 
killedBy: R7–R9 — three-tier knowledge R8: fires when a knownFact is not in knows
statusReason: expected [ [ '', +0, 'knownFacts', +0 ] ] to deep equally contain [ 'suspects', +0, 'knownFacts', +0 ]

[Killed] BlockStatement
src/refinements.ts:207:57
     }
 
     // R9: each secret.fact ∈ knows ∧ ∉ knownFacts
-    for (let seci = 0; seci < s.secrets.length; seci++) {
-      const sec = s.secrets[seci];
-      if (sec === undefined) continue;
-      if (!knowsSet.has(sec.fact)) {
-        addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
-          'suspects',
-          si,
-          'secrets',
-          seci,
-          'fact',
-        ]);
-      } else if (knownFactsSet.has(sec.fact)) {
-        addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
-          'suspects',
-          si,
-          'secrets',
-          seci,
-          'fact',
-        ]);
-      }
-    }
+    for (let seci = 0; seci < s.secrets.length; seci++) {}
 
     // R10a: relationship.to resolves to suspects[]∪{victim.id}
killedBy: R7–R9 — three-tier knowledge R9a: fires when a secret fact is not in knows
statusReason: expected issue SECRET_FACT_COHERENT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:207:24
     }
 
     // R9: each secret.fact ∈ knows ∧ ∉ knownFacts
-    for (let seci = 0; seci < s.secrets.length; seci++) {
+    for (let seci = 0; false; seci++) {
       const sec = s.secrets[seci];
       if (sec === undefined) continue;
killedBy: R7–R9 — three-tier knowledge R9a: fires when a secret fact is not in knows
statusReason: expected issue SECRET_FACT_COHERENT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:209:11
     // R9: each secret.fact ∈ knows ∧ ∉ knownFacts
     for (let seci = 0; seci < s.secrets.length; seci++) {
       const sec = s.secrets[seci];
-      if (sec === undefined) continue;
+      if (true) continue;
       if (!knowsSet.has(sec.fact)) {
         addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
killedBy: R7–R9 — three-tier knowledge R9a: fires when a secret fact is not in knows
statusReason: expected issue SECRET_FACT_COHERENT to fire: expected [] to not have a length of +0

[Killed] EqualityOperator
src/refinements.ts:209:11
     // R9: each secret.fact ∈ knows ∧ ∉ knownFacts
     for (let seci = 0; seci < s.secrets.length; seci++) {
       const sec = s.secrets[seci];
-      if (sec === undefined) continue;
+      if (sec !== undefined) continue;
       if (!knowsSet.has(sec.fact)) {
         addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
killedBy: R7–R9 — three-tier knowledge R9a: fires when a secret fact is not in knows
statusReason: expected issue SECRET_FACT_COHERENT to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:210:36
     for (let seci = 0; seci < s.secrets.length; seci++) {
       const sec = s.secrets[seci];
       if (sec === undefined) continue;
-      if (!knowsSet.has(sec.fact)) {
-        addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
-          'suspects',
-          si,
-          'secrets',
-          seci,
-          'fact',
-        ]);
-      } else if (knownFactsSet.has(sec.fact)) {
+      if (!knowsSet.has(sec.fact)) {} else if (knownFactsSet.has(sec.fact)) {
         addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
           'suspects',
killedBy: R7–R9 — three-tier knowledge R9a: fires when a secret fact is not in knows
statusReason: expected issue SECRET_FACT_COHERENT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:210:11
     for (let seci = 0; seci < s.secrets.length; seci++) {
       const sec = s.secrets[seci];
       if (sec === undefined) continue;
-      if (!knowsSet.has(sec.fact)) {
+      if (false) {
         addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
           'suspects',
killedBy: R7–R9 — three-tier knowledge R9a: fires when a secret fact is not in knows
statusReason: expected issue SECRET_FACT_COHERENT to fire: expected [] to not have a length of +0

[Killed] StringLiteral
src/refinements.ts:216:11
           si,
           'secrets',
           seci,
-          'fact',
+          "",
         ]);
       } else if (knownFactsSet.has(sec.fact)) {
killedBy: R7–R9 — three-tier knowledge R9a: fires when a secret fact is not in knows
statusReason: expected [ Array(1) ] to deep equally contain [ Array(5) ]

[Killed] ConditionalExpression
src/refinements.ts:218:18
           seci,
           'fact',
         ]);
-      } else if (knownFactsSet.has(sec.fact)) {
+      } else if (true) {
         addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
           'suspects',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:218:18
           seci,
           'fact',
         ]);
-      } else if (knownFactsSet.has(sec.fact)) {
+      } else if (false) {
         addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
           'suspects',
killedBy: R7–R9 — three-tier knowledge R9b: fires when a secret fact is also a knownFact
statusReason: expected issue SECRET_FACT_COHERENT to fire: expected [] to not have a length of +0

[Killed] ArrayDeclaration
src/refinements.ts:219:59
           'fact',
         ]);
       } else if (knownFactsSet.has(sec.fact)) {
-        addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
-          'suspects',
-          si,
-          'secrets',
-          seci,
-          'fact',
-        ]);
+        addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, []);
       }
     }
killedBy: R7–R9 — three-tier knowledge R9b: fires when a secret fact is also a knownFact
statusReason: expected [ [] ] to deep equally contain [ 'suspects', +0, 'secrets', +0, …(1) ]

[Killed] StringLiteral
src/refinements.ts:222:11
         addIssue(ctx, CaseIssueCode.SECRET_FACT_COHERENT, [
           'suspects',
           si,
-          'secrets',
+          "",
           seci,
           'fact',
killedBy: R7–R9 — three-tier knowledge R9b: fires when a secret fact is also a knownFact
statusReason: expected [ [ 'suspects', +0, '', +0, 'fact' ] ] to deep equally contain [ 'suspects', +0, 'secrets', +0, …(1) ]

[Killed] ArrayDeclaration
src/refinements.ts:231:36
 
     // R10a: relationship.to resolves to suspects[]∪{victim.id}
     // R10b: no self-edge (to !== owning suspect's id)
-    const validPersonIds = new Set([...suspectIds, val.victim.id]);
+    const validPersonIds = new Set([]);
     for (let ri = 0; ri < s.relationships.length; ri++) {
       const rel = s.relationships[ri];
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:232:22
     // R10a: relationship.to resolves to suspects[]∪{victim.id}
     // R10b: no self-edge (to !== owning suspect's id)
     const validPersonIds = new Set([...suspectIds, val.victim.id]);
-    for (let ri = 0; ri < s.relationships.length; ri++) {
+    for (let ri = 0; false; ri++) {
       const rel = s.relationships[ri];
       if (rel === undefined) continue;
killedBy: R10 — relationship edges R10a: fires when target does not resolve
statusReason: expected issue RELATIONSHIP_TARGET_RESOLVES to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:232:57
     // R10a: relationship.to resolves to suspects[]∪{victim.id}
     // R10b: no self-edge (to !== owning suspect's id)
     const validPersonIds = new Set([...suspectIds, val.victim.id]);
-    for (let ri = 0; ri < s.relationships.length; ri++) {
-      const rel = s.relationships[ri];
-      if (rel === undefined) continue;
-      if (!validPersonIds.has(rel.to)) {
-        addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, [
-          'suspects',
-          si,
-          'relationships',
-          ri,
-          'to',
-        ]);
-      }
-      if (rel.to === s.id) {
-        addIssue(ctx, CaseIssueCode.RELATIONSHIP_NO_SELF_EDGE, [
-          'suspects',
-          si,
-          'relationships',
-          ri,
-          'to',
-        ]);
-      }
-    }
+    for (let ri = 0; ri < s.relationships.length; ri++) {}
 
     // R11: clue-presented leakTriggers resolve against clues[]
killedBy: R10 — relationship edges R10a: fires when target does not resolve
statusReason: expected issue RELATIONSHIP_TARGET_RESOLVES to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:234:11
     const validPersonIds = new Set([...suspectIds, val.victim.id]);
     for (let ri = 0; ri < s.relationships.length; ri++) {
       const rel = s.relationships[ri];
-      if (rel === undefined) continue;
+      if (true) continue;
       if (!validPersonIds.has(rel.to)) {
         addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, [
killedBy: R10 — relationship edges R10a: fires when target does not resolve
statusReason: expected issue RELATIONSHIP_TARGET_RESOLVES to fire: expected [] to not have a length of +0

[Killed] EqualityOperator
src/refinements.ts:234:11
     const validPersonIds = new Set([...suspectIds, val.victim.id]);
     for (let ri = 0; ri < s.relationships.length; ri++) {
       const rel = s.relationships[ri];
-      if (rel === undefined) continue;
+      if (rel !== undefined) continue;
       if (!validPersonIds.has(rel.to)) {
         addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, [
killedBy: R10 — relationship edges R10a: fires when target does not resolve
statusReason: expected issue RELATIONSHIP_TARGET_RESOLVES to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:235:40
     for (let ri = 0; ri < s.relationships.length; ri++) {
       const rel = s.relationships[ri];
       if (rel === undefined) continue;
-      if (!validPersonIds.has(rel.to)) {
-        addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, [
-          'suspects',
-          si,
-          'relationships',
-          ri,
-          'to',
-        ]);
-      }
+      if (!validPersonIds.has(rel.to)) {}
       if (rel.to === s.id) {
         addIssue(ctx, CaseIssueCode.RELATIONSHIP_NO_SELF_EDGE, [
killedBy: R10 — relationship edges R10a: fires when target does not resolve
statusReason: expected issue RELATIONSHIP_TARGET_RESOLVES to fire: expected [] to not have a length of +0

[Killed] BooleanLiteral
src/refinements.ts:235:11
     for (let ri = 0; ri < s.relationships.length; ri++) {
       const rel = s.relationships[ri];
       if (rel === undefined) continue;
-      if (!validPersonIds.has(rel.to)) {
+      if (validPersonIds.has(rel.to)) {
         addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, [
           'suspects',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/refinements.ts:236:67
       const rel = s.relationships[ri];
       if (rel === undefined) continue;
       if (!validPersonIds.has(rel.to)) {
-        addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, [
-          'suspects',
-          si,
-          'relationships',
-          ri,
-          'to',
-        ]);
+        addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, []);
       }
       if (rel.to === s.id) {
killedBy: R10 — relationship edges R10a: fires when target does not resolve
statusReason: expected [ [] ] to deep equally contain [ Array(5) ]

[Killed] StringLiteral
src/refinements.ts:237:11
       if (rel === undefined) continue;
       if (!validPersonIds.has(rel.to)) {
         addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, [
-          'suspects',
+          "",
           si,
           'relationships',
killedBy: R10 — relationship edges R10a: fires when target does not resolve
statusReason: expected [ Array(1) ] to deep equally contain [ Array(5) ]

[Killed] StringLiteral
src/refinements.ts:239:11
         addIssue(ctx, CaseIssueCode.RELATIONSHIP_TARGET_RESOLVES, [
           'suspects',
           si,
-          'relationships',
+          "",
           ri,
           'to',
killedBy: R10 — relationship edges R10a: fires when target does not resolve
statusReason: expected [ [ 'suspects', 1, '', +0, 'to' ] ] to deep equally contain [ Array(5) ]

[Killed] ConditionalExpression
src/refinements.ts:244:11
           'to',
         ]);
       }
-      if (rel.to === s.id) {
+      if (false) {
         addIssue(ctx, CaseIssueCode.RELATIONSHIP_NO_SELF_EDGE, [
           'suspects',
killedBy: R10 — relationship edges R10b: fires on a self-edge (resolves, so only the self-edge code fires)
statusReason: expected issue RELATIONSHIP_NO_SELF_EDGE to fire: expected [] to not have a length of +0

[Killed] EqualityOperator
src/refinements.ts:244:11
           'to',
         ]);
       }
-      if (rel.to === s.id) {
+      if (rel.to !== s.id) {
         addIssue(ctx, CaseIssueCode.RELATIONSHIP_NO_SELF_EDGE, [
           'suspects',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/refinements.ts:256:57
     }
 
     // R11: clue-presented leakTriggers resolve against clues[]
-    for (let seci = 0; seci < s.secrets.length; seci++) {
-      const sec = s.secrets[seci];
-      if (sec === undefined) continue;
-      if (sec.leakTrigger.kind === 'clue-presented' && !clueIds.has(sec.leakTrigger.clueId)) {
-        addIssue(ctx, CaseIssueCode.SECRET_TRIGGER_RESOLVES, [
-          'suspects',
-          si,
-          'secrets',
-          seci,
-          'leakTrigger',
-          'clueId',
-        ]);
-      }
-    }
+    for (let seci = 0; seci < s.secrets.length; seci++) {}
 
     // R12: alibi.breaksWhen (when present, clue-presented) clueId resolves
killedBy: R11/R12 — clue-presented trigger cross-checks R11: fires when a secret clue-presented trigger is unknown
statusReason: expected issue SECRET_TRIGGER_RESOLVES to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:256:24
     }
 
     // R11: clue-presented leakTriggers resolve against clues[]
-    for (let seci = 0; seci < s.secrets.length; seci++) {
+    for (let seci = 0; false; seci++) {
       const sec = s.secrets[seci];
       if (sec === undefined) continue;
killedBy: R11/R12 — clue-presented trigger cross-checks R11: fires when a secret clue-presented trigger is unknown
statusReason: expected issue SECRET_TRIGGER_RESOLVES to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:259:11
     for (let seci = 0; seci < s.secrets.length; seci++) {
       const sec = s.secrets[seci];
       if (sec === undefined) continue;
-      if (sec.leakTrigger.kind === 'clue-presented' && !clueIds.has(sec.leakTrigger.clueId)) {
+      if (true) {
         addIssue(ctx, CaseIssueCode.SECRET_TRIGGER_RESOLVES, [
           'suspects',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality
