[Killed] ConditionalExpression
src/refinements.ts:259:11
     for (let seci = 0; seci < s.secrets.length; seci++) {
       const sec = s.secrets[seci];
       if (sec === undefined) continue;
-      if (sec.leakTrigger.kind === 'clue-presented' && !clueIds.has(sec.leakTrigger.clueId)) {
+      if (true && !clueIds.has(sec.leakTrigger.clueId)) {
         addIssue(ctx, CaseIssueCode.SECRET_TRIGGER_RESOLVES, [
           'suspects',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/refinements.ts:265:11
           si,
           'secrets',
           seci,
-          'leakTrigger',
+          "",
           'clueId',
         ]);
killedBy: R11/R12 — clue-presented trigger cross-checks R11: fires when a secret clue-presented trigger is unknown
statusReason: expected [ [ 'suspects', +0, 'secrets', …(3) ] ] to deep equally contain [ 'suspects', +0, 'secrets', +0, …(2) ]

[Killed] StringLiteral
src/refinements.ts:266:11
           'secrets',
           seci,
           'leakTrigger',
-          'clueId',
+          "",
         ]);
       }
killedBy: R11/R12 — clue-presented trigger cross-checks R11: fires when a secret clue-presented trigger is unknown
statusReason: expected [ [ 'suspects', +0, 'secrets', …(3) ] ] to deep equally contain [ 'suspects', +0, 'secrets', +0, …(2) ]

[Killed] LogicalOperator
src/refinements.ts:273:9
 
     // R12: alibi.breaksWhen (when present, clue-presented) clueId resolves
     const bw = s.alibi.breaksWhen;
-    if (bw !== undefined && bw.kind === 'clue-presented' && !clueIds.has(bw.clueId)) {
+    if (bw !== undefined || bw.kind === 'clue-presented' && !clueIds.has(bw.clueId)) {
       addIssue(ctx, CaseIssueCode.ALIBI_TRIGGER_RESOLVES, [
         'suspects',
killedBy: valid fixture parses clean (no issues)
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] EqualityOperator
src/refinements.ts:273:9
 
     // R12: alibi.breaksWhen (when present, clue-presented) clueId resolves
     const bw = s.alibi.breaksWhen;
-    if (bw !== undefined && bw.kind === 'clue-presented' && !clueIds.has(bw.clueId)) {
+    if (bw === undefined && bw.kind === 'clue-presented' && !clueIds.has(bw.clueId)) {
       addIssue(ctx, CaseIssueCode.ALIBI_TRIGGER_RESOLVES, [
         'suspects',
killedBy: valid fixture parses clean (no issues)
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] StringLiteral
src/refinements.ts:277:9
       addIssue(ctx, CaseIssueCode.ALIBI_TRIGGER_RESOLVES, [
         'suspects',
         si,
-        'alibi',
+        "",
         'breaksWhen',
         'clueId',
killedBy: R11/R12 — clue-presented trigger cross-checks R12: fires when an alibi clue-presented trigger is unknown
statusReason: expected [ [ 'suspects', +0, '', …(2) ] ] to deep equally contain [ 'suspects', +0, 'alibi', …(2) ]

[Killed] StringLiteral
src/refinements.ts:278:9
         'suspects',
         si,
         'alibi',
-        'breaksWhen',
+        "",
         'clueId',
       ]);
killedBy: R11/R12 — clue-presented trigger cross-checks R12: fires when an alibi clue-presented trigger is unknown
statusReason: expected [ [ 'suspects', +0, 'alibi', …(2) ] ] to deep equally contain [ 'suspects', +0, 'alibi', …(2) ]

[Killed] StringLiteral
src/refinements.ts:279:9
         si,
         'alibi',
         'breaksWhen',
-        'clueId',
+        "",
       ]);
     }
killedBy: R11/R12 — clue-presented trigger cross-checks R12: fires when an alibi clue-presented trigger is unknown
statusReason: expected [ [ 'suspects', +0, 'alibi', …(2) ] ] to deep equally contain [ 'suspects', +0, 'alibi', …(2) ]

[Killed] BlockStatement
src/refinements.ts:284:67
     }
 
     // R16: culprit's alibi must have breaksWhen (the lie must be breakable)
-    if (s.role === 'culprit' && s.alibi.breaksWhen === undefined) {
-      addIssue(ctx, CaseIssueCode.CULPRIT_ALIBI_BREAKABLE, ['suspects', si, 'alibi']);
-    }
+    if (s.role === 'culprit' && s.alibi.breaksWhen === undefined) {}
   }
 
killedBy: R16 — culprit alibi must be breakable fires when the culprit has no breaksWhen
statusReason: expected issue CULPRIT_ALIBI_BREAKABLE to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:284:9
     }
 
     // R16: culprit's alibi must have breaksWhen (the lie must be breakable)
-    if (s.role === 'culprit' && s.alibi.breaksWhen === undefined) {
+    if (false) {
       addIssue(ctx, CaseIssueCode.CULPRIT_ALIBI_BREAKABLE, ['suspects', si, 'alibi']);
     }
killedBy: R16 — culprit alibi must be breakable fires when the culprit has no breaksWhen
statusReason: expected issue CULPRIT_ALIBI_BREAKABLE to fire: expected [] to not have a length of +0

[Killed] StringLiteral
src/refinements.ts:285:61
 
     // R16: culprit's alibi must have breaksWhen (the lie must be breakable)
     if (s.role === 'culprit' && s.alibi.breaksWhen === undefined) {
-      addIssue(ctx, CaseIssueCode.CULPRIT_ALIBI_BREAKABLE, ['suspects', si, 'alibi']);
+      addIssue(ctx, CaseIssueCode.CULPRIT_ALIBI_BREAKABLE, ["", si, 'alibi']);
     }
   }
killedBy: R16 — culprit alibi must be breakable fires when the culprit has no breaksWhen
statusReason: expected [ [ '', +0, 'alibi' ] ] to deep equally contain [ 'suspects', +0, 'alibi' ]

[Killed] ArrayDeclaration
src/refinements.ts:285:60
 
     // R16: culprit's alibi must have breaksWhen (the lie must be breakable)
     if (s.role === 'culprit' && s.alibi.breaksWhen === undefined) {
-      addIssue(ctx, CaseIssueCode.CULPRIT_ALIBI_BREAKABLE, ['suspects', si, 'alibi']);
+      addIssue(ctx, CaseIssueCode.CULPRIT_ALIBI_BREAKABLE, []);
     }
   }
killedBy: R16 — culprit alibi must be breakable fires when the culprit has no breaksWhen
statusReason: expected [ [] ] to deep equally contain [ 'suspects', +0, 'alibi' ]

[Killed] EqualityOperator
src/refinements.ts:293:20
   // R13a–R13d: clue refersTo cross-checks
   // -------------------------------------------------------------------------
 
-  for (let ci = 0; ci < val.clues.length; ci++) {
+  for (let ci = 0; ci >= val.clues.length; ci++) {
     const clue = val.clues[ci];
     if (clue === undefined || clue.refersTo === undefined) continue;
killedBy: R13 — clue refersTo cross-checks R13a: fires on unknown suspect ref
statusReason: expected issue CLUE_REFS_SUSPECT_RESOLVES to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:293:20
   // R13a–R13d: clue refersTo cross-checks
   // -------------------------------------------------------------------------
 
-  for (let ci = 0; ci < val.clues.length; ci++) {
+  for (let ci = 0; false; ci++) {
     const clue = val.clues[ci];
     if (clue === undefined || clue.refersTo === undefined) continue;
killedBy: R13 — clue refersTo cross-checks R13a: fires on unknown suspect ref
statusReason: expected issue CLUE_REFS_SUSPECT_RESOLVES to fire: expected [] to not have a length of +0

[Killed] LogicalOperator
src/refinements.ts:295:9
 
   for (let ci = 0; ci < val.clues.length; ci++) {
     const clue = val.clues[ci];
-    if (clue === undefined || clue.refersTo === undefined) continue;
+    if (clue === undefined && clue.refersTo === undefined) continue;
 
     const rt = clue.refersTo;
killedBy: valid fixture parses clean (no issues)
statusReason: Cannot read properties of undefined (reading 'suspectId')

[Killed] EqualityOperator
src/refinements.ts:295:31
 
   for (let ci = 0; ci < val.clues.length; ci++) {
     const clue = val.clues[ci];
-    if (clue === undefined || clue.refersTo === undefined) continue;
+    if (clue === undefined || clue.refersTo !== undefined) continue;
 
     const rt = clue.refersTo;
killedBy: valid fixture parses clean (no issues)
statusReason: Cannot read properties of undefined (reading 'suspectId')

[Killed] ConditionalExpression
src/refinements.ts:298:9
     if (clue === undefined || clue.refersTo === undefined) continue;
 
     const rt = clue.refersTo;
-    if (rt.suspectId !== undefined && !suspectIds.has(rt.suspectId)) {
+    if (true) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_SUSPECT_RESOLVES, [
         'clues',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:298:9
     if (clue === undefined || clue.refersTo === undefined) continue;
 
     const rt = clue.refersTo;
-    if (rt.suspectId !== undefined && !suspectIds.has(rt.suspectId)) {
+    if (true && !suspectIds.has(rt.suspectId)) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_SUSPECT_RESOLVES, [
         'clues',
killedBy: R13 — clue refersTo cross-checks an empty refersTo object cross-checks nothing (each ref is independently optional)
statusReason: expected [ 'CLUE_REFS_SUSPECT_RESOLVES' ] to not include 'CLUE_REFS_SUSPECT_RESOLVES'

[Killed] StringLiteral
src/refinements.ts:303:9
         'clues',
         ci,
         'refersTo',
-        'suspectId',
+        "",
       ]);
     }
killedBy: R13 — clue refersTo cross-checks R13a: fires on unknown suspect ref
statusReason: expected [ [ 'clues', +0, 'refersTo', '' ] ] to deep equally contain [ Array(4) ]

[Killed] ConditionalExpression
src/refinements.ts:306:9
         'suspectId',
       ]);
     }
-    if (rt.weaponId !== undefined && !weaponIds.has(rt.weaponId)) {
+    if (true) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_WEAPON_RESOLVES, ['clues', ci, 'refersTo', 'weaponId']);
     }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:306:9
         'suspectId',
       ]);
     }
-    if (rt.weaponId !== undefined && !weaponIds.has(rt.weaponId)) {
+    if (true && !weaponIds.has(rt.weaponId)) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_WEAPON_RESOLVES, ['clues', ci, 'refersTo', 'weaponId']);
     }
killedBy: R13 — clue refersTo cross-checks an empty refersTo object cross-checks nothing (each ref is independently optional)
statusReason: expected [ 'CLUE_REFS_WEAPON_RESOLVES' ] to not include 'CLUE_REFS_WEAPON_RESOLVES'

[Killed] StringLiteral
src/refinements.ts:307:88
       ]);
     }
     if (rt.weaponId !== undefined && !weaponIds.has(rt.weaponId)) {
-      addIssue(ctx, CaseIssueCode.CLUE_REFS_WEAPON_RESOLVES, ['clues', ci, 'refersTo', 'weaponId']);
+      addIssue(ctx, CaseIssueCode.CLUE_REFS_WEAPON_RESOLVES, ['clues', ci, 'refersTo', ""]);
     }
     if (rt.locationId !== undefined && !locationIds.has(rt.locationId)) {
killedBy: R13 — clue refersTo cross-checks R13b: fires on unknown weapon ref
statusReason: expected [ [ 'clues', +0, 'refersTo', '' ] ] to deep equally contain [ 'clues', +0, 'refersTo', 'weaponId' ]

[Killed] ConditionalExpression
src/refinements.ts:309:9
     if (rt.weaponId !== undefined && !weaponIds.has(rt.weaponId)) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_WEAPON_RESOLVES, ['clues', ci, 'refersTo', 'weaponId']);
     }
-    if (rt.locationId !== undefined && !locationIds.has(rt.locationId)) {
+    if (true) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_LOCATION_RESOLVES, [
         'clues',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:309:9
     if (rt.weaponId !== undefined && !weaponIds.has(rt.weaponId)) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_WEAPON_RESOLVES, ['clues', ci, 'refersTo', 'weaponId']);
     }
-    if (rt.locationId !== undefined && !locationIds.has(rt.locationId)) {
+    if (true && !locationIds.has(rt.locationId)) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_LOCATION_RESOLVES, [
         'clues',
killedBy: R13 — clue refersTo cross-checks an empty refersTo object cross-checks nothing (each ref is independently optional)
statusReason: expected [ 'CLUE_REFS_LOCATION_RESOLVES' ] to not include 'CLUE_REFS_LOCATION_RESOLVES'

[Killed] StringLiteral
src/refinements.ts:311:9
     }
     if (rt.locationId !== undefined && !locationIds.has(rt.locationId)) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_LOCATION_RESOLVES, [
-        'clues',
+        "",
         ci,
         'refersTo',
killedBy: R13 — clue refersTo cross-checks R13c: fires on unknown location ref
statusReason: expected [ Array(1) ] to deep equally contain [ 'clues', +0, 'refersTo', …(1) ]

[Killed] ConditionalExpression
src/refinements.ts:317:9
         'locationId',
       ]);
     }
-    if (rt.timeSlotId !== undefined && !timeSlotIds.has(rt.timeSlotId)) {
+    if (false) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_TIMESLOT_RESOLVES, [
         'clues',
killedBy: R13 — clue refersTo cross-checks R13d: fires on unknown timeslot ref
statusReason: expected issue CLUE_REFS_TIMESLOT_RESOLVES to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:317:9
         'locationId',
       ]);
     }
-    if (rt.timeSlotId !== undefined && !timeSlotIds.has(rt.timeSlotId)) {
+    if (true) {
       addIssue(ctx, CaseIssueCode.CLUE_REFS_TIMESLOT_RESOLVES, [
         'clues',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:331:50
   // R14: at least one non-culprit suspect (one-suspect case is unsolvable)
   // -------------------------------------------------------------------------
 
-  const nonCulprits = val.suspects.filter((s) => s.role !== 'culprit');
+  const nonCulprits = val.suspects.filter((s) => false);
   if (nonCulprits.length === 0) {
     addIssue(ctx, CaseIssueCode.WITNESS_OR_HERRING_PRESENT, ['suspects']);
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/refinements.ts:331:43
   // R14: at least one non-culprit suspect (one-suspect case is unsolvable)
   // -------------------------------------------------------------------------
 
-  const nonCulprits = val.suspects.filter((s) => s.role !== 'culprit');
+  const nonCulprits = val.suspects.filter(() => undefined);
   if (nonCulprits.length === 0) {
     addIssue(ctx, CaseIssueCode.WITNESS_OR_HERRING_PRESENT, ['suspects']);
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:332:7
   // -------------------------------------------------------------------------
 
   const nonCulprits = val.suspects.filter((s) => s.role !== 'culprit');
-  if (nonCulprits.length === 0) {
+  if (false) {
     addIssue(ctx, CaseIssueCode.WITNESS_OR_HERRING_PRESENT, ['suspects']);
   }
killedBy: R14 — at least one non-culprit fires when every suspect is the culprit (unsolvable)
statusReason: expected issue WITNESS_OR_HERRING_PRESENT to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:332:7
   // -------------------------------------------------------------------------
 
   const nonCulprits = val.suspects.filter((s) => s.role !== 'culprit');
-  if (nonCulprits.length === 0) {
+  if (true) {
     addIssue(ctx, CaseIssueCode.WITNESS_OR_HERRING_PRESENT, ['suspects']);
   }
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/refinements.ts:341:20
   // -------------------------------------------------------------------------
 
   const seenOrders = new Set<number>();
-  for (let ti = 0; ti < val.timeline.length; ti++) {
+  for (let ti = 0; false; ti++) {
     const slot = val.timeline[ti];
     if (slot === undefined) continue;
killedBy: R15 — timeline order uniqueness fires on duplicate order at the duplicate index
statusReason: expected issue TIMESLOT_ORDER_UNIQUE to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:341:52
   // -------------------------------------------------------------------------
 
   const seenOrders = new Set<number>();
-  for (let ti = 0; ti < val.timeline.length; ti++) {
-    const slot = val.timeline[ti];
-    if (slot === undefined) continue;
-    if (seenOrders.has(slot.order)) {
-      addIssue(ctx, CaseIssueCode.TIMESLOT_ORDER_UNIQUE, ['timeline', ti, 'order']);
-    } else {
-      seenOrders.add(slot.order);
-    }
-  }
+  for (let ti = 0; ti < val.timeline.length; ti++) {}
 }
 
killedBy: R15 — timeline order uniqueness fires on duplicate order at the duplicate index
statusReason: expected issue TIMESLOT_ORDER_UNIQUE to fire: expected [] to not have a length of +0

[Killed] EqualityOperator
src/refinements.ts:343:9
   const seenOrders = new Set<number>();
   for (let ti = 0; ti < val.timeline.length; ti++) {
     const slot = val.timeline[ti];
-    if (slot === undefined) continue;
+    if (slot !== undefined) continue;
     if (seenOrders.has(slot.order)) {
       addIssue(ctx, CaseIssueCode.TIMESLOT_ORDER_UNIQUE, ['timeline', ti, 'order']);
killedBy: R15 — timeline order uniqueness fires on duplicate order at the duplicate index
statusReason: expected issue TIMESLOT_ORDER_UNIQUE to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:343:9
   const seenOrders = new Set<number>();
   for (let ti = 0; ti < val.timeline.length; ti++) {
     const slot = val.timeline[ti];
-    if (slot === undefined) continue;
+    if (true) continue;
     if (seenOrders.has(slot.order)) {
       addIssue(ctx, CaseIssueCode.TIMESLOT_ORDER_UNIQUE, ['timeline', ti, 'order']);
killedBy: R15 — timeline order uniqueness fires on duplicate order at the duplicate index
statusReason: expected issue TIMESLOT_ORDER_UNIQUE to fire: expected [] to not have a length of +0

[Killed] BlockStatement
src/refinements.ts:344:37
   for (let ti = 0; ti < val.timeline.length; ti++) {
     const slot = val.timeline[ti];
     if (slot === undefined) continue;
-    if (seenOrders.has(slot.order)) {
-      addIssue(ctx, CaseIssueCode.TIMESLOT_ORDER_UNIQUE, ['timeline', ti, 'order']);
-    } else {
+    if (seenOrders.has(slot.order)) {} else {
       seenOrders.add(slot.order);
     }
killedBy: R15 — timeline order uniqueness fires on duplicate order at the duplicate index
statusReason: expected issue TIMESLOT_ORDER_UNIQUE to fire: expected [] to not have a length of +0

[Killed] ConditionalExpression
src/refinements.ts:344:9
   for (let ti = 0; ti < val.timeline.length; ti++) {
     const slot = val.timeline[ti];
     if (slot === undefined) continue;
-    if (seenOrders.has(slot.order)) {
+    if (true) {
       addIssue(ctx, CaseIssueCode.TIMESLOT_ORDER_UNIQUE, ['timeline', ti, 'order']);
     } else {
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/refinements.ts:345:75
     const slot = val.timeline[ti];
     if (slot === undefined) continue;
     if (seenOrders.has(slot.order)) {
-      addIssue(ctx, CaseIssueCode.TIMESLOT_ORDER_UNIQUE, ['timeline', ti, 'order']);
+      addIssue(ctx, CaseIssueCode.TIMESLOT_ORDER_UNIQUE, ['timeline', ti, ""]);
     } else {
       seenOrders.add(slot.order);
killedBy: R15 — timeline order uniqueness fires on duplicate order at the duplicate index
statusReason: expected [ [ 'timeline', 1, '' ] ] to deep equally contain [ 'timeline', 1, 'order' ]

[Killed] BlockStatement
src/refinements.ts:346:12
     if (slot === undefined) continue;
     if (seenOrders.has(slot.order)) {
       addIssue(ctx, CaseIssueCode.TIMESLOT_ORDER_UNIQUE, ['timeline', ti, 'order']);
-    } else {
-      seenOrders.add(slot.order);
-    }
+    } else {}
   }
 }
killedBy: R15 — timeline order uniqueness fires on duplicate order at the duplicate index
statusReason: expected issue TIMESLOT_ORDER_UNIQUE to fire: expected [] to not have a length of +0
