[Killed] MethodExpression
src/case-file.ts:12:9
 /** A named victim (single per case). */
 export const Victim = z.object({
   id: VictimId,
-  name: z.string().min(1),
+  name: z.string().max(1),
 });
 export type Victim = z.infer<typeof Victim>;
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/case-file.ts:17:32
 export type Victim = z.infer<typeof Victim>;
 
 /** A weapon in the finite weapon catalog. */
-export const Weapon = z.object({
-  id: WeaponId,
-  label: z.string().min(1),
-});
+export const Weapon = z.object({});
 export type Weapon = z.infer<typeof Weapon>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/case-file.ts:19:10
 /** A weapon in the finite weapon catalog. */
 export const Weapon = z.object({
   id: WeaponId,
-  label: z.string().min(1),
+  label: z.string().max(1),
 });
 export type Weapon = z.infer<typeof Weapon>;
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/case-file.ts:26:10
 /** A location in the finite location catalog. */
 export const Location = z.object({
   id: LocationId,
-  label: z.string().min(1),
+  label: z.string().max(1),
 });
 export type Location = z.infer<typeof Location>;
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/case-file.ts:34:34
  * A time slot in the ordered, finite timeline.
  * `order` values must be unique across the timeline (R15) so the engine can sort.
  */
-export const TimeSlot = z.object({
-  id: TimeSlotId,
-  label: z.string().min(1),
-  order: z.number().int().nonnegative(),
-});
+export const TimeSlot = z.object({});
 export type TimeSlot = z.infer<typeof TimeSlot>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/case-file.ts:36:10
  */
 export const TimeSlot = z.object({
   id: TimeSlotId,
-  label: z.string().min(1),
+  label: z.string().max(1),
   order: z.number().int().nonnegative(),
 });
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/case-file.ts:48:9
  */
 export const CaseFile = z
   .object({
-    id: z.string().min(1),
+    id: z.string().max(1),
     victim: Victim,
     weapons: z.array(Weapon).nonempty(),
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality
