[Killed] MethodExpression
src/clue.ts:16:14
  */
 export const Clue = z.object({
   id: ClueId,
-  statement: z.string().min(1),
+  statement: z.string().max(1),
   /** SERVER-ONLY */
   reliability: ClueReliability,
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/clue.ts:20:13
   /** SERVER-ONLY */
   reliability: ClueReliability,
   refersTo: z
-    .object({
-      suspectId: SuspectId.optional(),
-      weaponId: WeaponId.optional(),
-      locationId: LocationId.optional(),
-      timeSlotId: TimeSlotId.optional(),
-    })
+    .object({})
     .optional(),
 });
killedBy: R13 — clue refersTo cross-checks R13a: fires on unknown suspect ref
statusReason: expected issue CLUE_REFS_SUSPECT_RESOLVES to fire: expected [] to not have a length of +0
