[Killed] ObjectLiteral
src/dossier.ts:12:32
  * secret.fact ∈ knowledge.knows ∧ secret.fact ∉ knownFacts  (enforced at CaseFile.superRefine R9)
  * SERVER-ONLY
  */
-export const Secret = z.object({
-  fact: z.string().min(1),
-  leakTrigger: Trigger,
-  /** In-character consequence prose if the secret leaks. Kept as prose (not structured) per plan. */
-  ifLeaked: z.string().min(1),
-});
+export const Secret = z.object({});
 export type Secret = z.infer<typeof Secret>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] MethodExpression
src/dossier.ts:13:9
  * SERVER-ONLY
  */
 export const Secret = z.object({
-  fact: z.string().min(1),
+  fact: z.string().max(1),
   leakTrigger: Trigger,
   /** In-character consequence prose if the secret leaks. Kept as prose (not structured) per plan. */
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/dossier.ts:16:13
   fact: z.string().min(1),
   leakTrigger: Trigger,
   /** In-character consequence prose if the secret leaks. Kept as prose (not structured) per plan. */
-  ifLeaked: z.string().min(1),
+  ifLeaked: z.string().max(1),
 });
 export type Secret = z.infer<typeof Secret>;
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/dossier.ts:27:12
  */
 export const Alibi = z
   .object({
-    claim: z.string().min(1),
+    claim: z.string().max(1),
     truth: z.string().min(1),
     breaksWhen: Trigger,
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/dossier.ts:28:12
 export const Alibi = z
   .object({
     claim: z.string().min(1),
-    truth: z.string().min(1),
+    truth: z.string().max(1),
     breaksWhen: Trigger,
   })
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/dossier.ts:31:26
     truth: z.string().min(1),
     breaksWhen: Trigger,
   })
-  .partial({ breaksWhen: true });
+  .partial({ breaksWhen: false });
 export type Alibi = z.infer<typeof Alibi>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/dossier.ts:41:15
 export const Relationship = z.object({
   to: PersonId,
   kind: RelationshipKind,
-  descriptor: z.string().min(1),
+  descriptor: z.string().max(1),
 });
 export type Relationship = z.infer<typeof Relationship>;
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/dossier.ts:53:18
  * SERVER-ONLY
  */
 export const Knowledge = z.object({
-  knows: z.array(z.string().min(1)),
+  knows: z.array(z.string().max(1)),
   doesNotKnow: z.array(z.string().min(1)),
 });
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/dossier.ts:54:24
  */
 export const Knowledge = z.object({
   knows: z.array(z.string().min(1)),
-  doesNotKnow: z.array(z.string().min(1)),
+  doesNotKnow: z.array(z.string().max(1)),
 });
 export type Knowledge = z.infer<typeof Knowledge>;
killedBy: Dossier schema parses the valid dossier
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/dossier.ts:67:33
  *
  * SERVER-ONLY fields: secrets, alibi, knowledge, isGuilty, role
  */
-export const Dossier = z.object({
-  id: SuspectId,
-  publicPersona: z.string().min(1),
-  /** Freely-offered facts — the subset of knowledge.knows the character volunteers. */
-  knownFacts: z.array(z.string().min(1)),
-  secrets: z.array(Secret),
-  alibi: Alibi,
-  relationships: z.array(Relationship),
-  knowledge: Knowledge,
-  isGuilty: z.boolean(),
-  role: Role,
-});
+export const Dossier = z.object({});
 export type Dossier = z.infer<typeof Dossier>;
 
killedBy: Dossier schema rejects omission of a required field (role)
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/dossier.ts:69:18
  */
 export const Dossier = z.object({
   id: SuspectId,
-  publicPersona: z.string().min(1),
+  publicPersona: z.string().max(1),
   /** Freely-offered facts — the subset of knowledge.knows the character volunteers. */
   knownFacts: z.array(z.string().min(1)),
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/dossier.ts:71:23
   id: SuspectId,
   publicPersona: z.string().min(1),
   /** Freely-offered facts — the subset of knowledge.knows the character volunteers. */
-  knownFacts: z.array(z.string().min(1)),
+  knownFacts: z.array(z.string().max(1)),
   secrets: z.array(Secret),
   alibi: Alibi,
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality
