[Killed] StringLiteral
src/enums.ts:4:55
 import { z } from 'zod';
 
 /** SERVER-ONLY truth — which narrative role the suspect plays. */
-export const Role = z.enum(['culprit', 'red-herring', 'witness']);
+export const Role = z.enum(['culprit', 'red-herring', ""]);
 export type Role = z.infer<typeof Role>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/enums.ts:4:29
 import { z } from 'zod';
 
 /** SERVER-ONLY truth — which narrative role the suspect plays. */
-export const Role = z.enum(['culprit', 'red-herring', 'witness']);
+export const Role = z.enum(["", 'red-herring', 'witness']);
 export type Role = z.infer<typeof Role>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/enums.ts:9:3
 
 /** Directed relationship kinds between cast members. */
 export const RelationshipKind = z.enum([
-  'spouse',
+  "",
   'sibling',
   'colleague',
killedBy: enums — every member round-trips and unknowns are rejected RelationshipKind accepts "spouse"
statusReason: [
  {
    "received": "spouse",
    "code": "invalid_enum_value",
    "options": [
      "",
      "sibling",
      "colleague",

[Killed] StringLiteral
src/enums.ts:12:3
   'spouse',
   'sibling',
   'colleague',
-  'rival',
+  "",
   'friend',
   'employer',
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/enums.ts:13:3
   'sibling',
   'colleague',
   'rival',
-  'friend',
+  "",
   'employer',
   'creditor',
killedBy: enums — every member round-trips and unknowns are rejected RelationshipKind accepts "friend"
statusReason: [
  {
    "received": "friend",
    "code": "invalid_enum_value",
    "options": [
      "spouse",
      "sibling",
      "colleague",

[Killed] StringLiteral
src/enums.ts:15:3
   'rival',
   'friend',
   'employer',
-  'creditor',
+  "",
   'stranger',
 ]);
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/enums.ts:21:40
 export type RelationshipKind = z.infer<typeof RelationshipKind>;
 
 /** SERVER-ONLY — misleading ⟹ the clue is a red-herring plant. */
-export const ClueReliability = z.enum(['truthful', 'misleading']);
+export const ClueReliability = z.enum(["", 'misleading']);
 export type ClueReliability = z.infer<typeof ClueReliability>;
 
killedBy: enums — every member round-trips and unknowns are rejected ClueReliability accepts "truthful"
statusReason: [
  {
    "received": "truthful",
    "code": "invalid_enum_value",
    "options": [
      "",
      "misleading"
    ],

[Killed] ArrayDeclaration
src/enums.ts:21:39
 export type RelationshipKind = z.infer<typeof RelationshipKind>;
 
 /** SERVER-ONLY — misleading ⟹ the clue is a red-herring plant. */
-export const ClueReliability = z.enum(['truthful', 'misleading']);
+export const ClueReliability = z.enum([]);
 export type ClueReliability = z.infer<typeof ClueReliability>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality
