[Killed] MethodExpression
src/ids.ts:7:26
 // Brands stop cross-type id confusion at compile time (e.g. VictimId ≠ SuspectId, so
 // Accusation.accusedSuspectId: SuspectId structurally cannot hold a VictimId).
 
-export const SuspectId = z.string().min(1).brand<'SuspectId'>();
+export const SuspectId = z.string().max(1).brand<'SuspectId'>();
 export type SuspectId = z.infer<typeof SuspectId>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/ids.ts:10:25
 export const SuspectId = z.string().min(1).brand<'SuspectId'>();
 export type SuspectId = z.infer<typeof SuspectId>;
 
-export const VictimId = z.string().min(1).brand<'VictimId'>();
+export const VictimId = z.string().max(1).brand<'VictimId'>();
 export type VictimId = z.infer<typeof VictimId>;
 
killedBy: Branded IDs VictimId rejects the empty string
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/ids.ts:13:25
 export const VictimId = z.string().min(1).brand<'VictimId'>();
 export type VictimId = z.infer<typeof VictimId>;
 
-export const WeaponId = z.string().min(1).brand<'WeaponId'>();
+export const WeaponId = z.string().max(1).brand<'WeaponId'>();
 export type WeaponId = z.infer<typeof WeaponId>;
 
killedBy: Clue schema parses the valid clue
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/ids.ts:16:27
 export const WeaponId = z.string().min(1).brand<'WeaponId'>();
 export type WeaponId = z.infer<typeof WeaponId>;
 
-export const LocationId = z.string().min(1).brand<'LocationId'>();
+export const LocationId = z.string().max(1).brand<'LocationId'>();
 export type LocationId = z.infer<typeof LocationId>;
 
killedBy: Clue schema parses the valid clue
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/ids.ts:19:27
 export const LocationId = z.string().min(1).brand<'LocationId'>();
 export type LocationId = z.infer<typeof LocationId>;
 
-export const TimeSlotId = z.string().min(1).brand<'TimeSlotId'>();
+export const TimeSlotId = z.string().max(1).brand<'TimeSlotId'>();
 export type TimeSlotId = z.infer<typeof TimeSlotId>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/ids.ts:22:23
 export const TimeSlotId = z.string().min(1).brand<'TimeSlotId'>();
 export type TimeSlotId = z.infer<typeof TimeSlotId>;
 
-export const ClueId = z.string().min(1).brand<'ClueId'>();
+export const ClueId = z.string().max(1).brand<'ClueId'>();
 export type ClueId = z.infer<typeof ClueId>;
 
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/ids.ts:30:33
  * Keeps SuspectId/VictimId distinct (Accusation cannot accuse the victim) while letting
  * a suspect relate to the victim (motive). R10a resolves .to against suspects[]∪{victim.id}.
  */
-export const PersonId = z.union([SuspectId, VictimId]);
+export const PersonId = z.union([]);
 export type PersonId = z.infer<typeof PersonId>;
 
killedBy: Dossier schema parses the valid dossier
statusReason: expected false to be true // Object.is equality
