[Survived] StringLiteral
src/trigger.ts:12:45
  * - 'fact-confronted'      — opaque prose; shared does NOT cross-check it (no fact catalog by design)
  * - 'contradiction-exposed' — no payload; fires when the suspect's story is contradicted
  */
-export const Trigger = z.discriminatedUnion('kind', [
+export const Trigger = z.discriminatedUnion("", [
   z.object({
     kind: z.literal('clue-presented'),

[Killed] MethodExpression
src/trigger.ts:19:11
   }),
   z.object({
     kind: z.literal('fact-confronted'),
-    fact: z.string().min(1),
+    fact: z.string().max(1),
   }),
   z.object({
killedBy: valid fixture parses clean (no issues)
statusReason: expected false to be true // Object.is equality
